[
  {
    "id": "_15ubgb5e1",
    "category": "Home",
    "title": "Cryptominers Targeting Misconfigured Apache Hadoop and Flink with Rootkit in New Attacks",
    "date": "Jan 12, 2024",
    "author": "Newsroom",
    "pTags": "Cryptocurrency / Malware",
    "imgLinks": [
      "_oyuvl7usy"
    ],
    "contentEn": "<p>Cybersecurity researchers have identified a new attack that exploits misconfigurations in Apache Hadoop and Flink to deploy cryptocurrency miners within targeted environments.</p><p>\"This attack is particularly intriguing due to the attacker's use of packers and rootkits to conceal the malware,\" Aqua security researchers Nitzan Yaakov and Assaf Morag  in an analysis published earlier this week. \"The malware deletes contents of specific directories and modifies system configurations to evade detection.\"</p><p>The infection chain targeting Hadoop leverages a misconfiguration in the YARN's (Yet Another Resource Negotiator) , which is responsible for tracking resources in a cluster and scheduling applications.</p><p>Specifically, the misconfiguration can be exploited by an unauthenticated, remote threat actor to execute arbitrary code by means of a crafted HTTP request, subject to the privileges of the user on the node where the code is executed.</p><p>The attacks aimed at Apache Flink, likewise, take aim at a misconfiguration that permits a remote attacker to achieve code execution sans any authentication.</p><p>These misconfigurations are not novel and have been  by financially motivated groups like TeamTNT, which is known for its history of targeting Docker and Kubernetes environments for the purpose of cryptojacking and other malicious activities.</p><p>But what makes the latest set of attacks noteworthy is the use of rootkits to hide crypto mining processes after obtaining an initial foothold into Hadoop and Flink applications.</p><p>\"The attacker sends an unauthenticated request to deploy a new application,\" the researchers explained. \"The attacker is able to run a remote code by sending a POST request to the YARN, requesting to launch the new application with the attacker's command.\"</p><p>The command is purpose-built to clear the /tmp directory of all existing content, fetch a file called \"dca\" from a remote server, and execute it, followed by deleting all files in the /tmp directory once again.</p><p>The executed payload is a packed ELF binary that acts as a downloader to retrieve two rootkits and a Monero cryptocurrency miner binary. It's worth pointing out that , including , have resorted to  to conceal the presence of the mining process.</p><p>To achieve persistence, a cron job is created to download and execute a shell script that deploys the 'dca' binary. Further analysis of the threat actor's infrastructure reveals that the staging server used to fetch the downloader was registered on October 31, 2023.</p><p>As mitigations, it's recommended that organizations deploy agent-based security solutions to detect cryptominers, rootkits, obfuscated or packed binaries, as well as other suspicious runtime behaviors.</p>",
    "ref": "https://thehackernews.com/2024/01/cryptominers-targeting-misconfigured.html",
    "titleTh": "Cryptominers กำหนดเป้าหมาย Apache Hadoop ที่กำหนดค่าไม่ถูกต้องและ Flink ด้วย Rootkit ในการโจมตีใหม่",
    "contentTh": "<p>นักวิจัยด้านความปลอดภัยทางไซเบอร์ได้ระบุการโจมตีใหม่ที่ใช้ประโยชน์จากการกำหนดค่าที่ไม่ถูกต้องใน Apache Hadoop และ Flink เพื่อปรับใช้นักขุด cryptocurrency ภายในสภาพแวดล้อมเป้าหมาย</p><p> “การโจมตีนี้น่าสนใจเป็นอย่างยิ่ง เนื่องจากผู้โจมตีใช้แพ็คเกอร์และรูทคิทเพื่อปกปิดมัลแวร์” นักวิจัยด้านความปลอดภัยของ Aqua Nitzan Yaakov และ Assaf Morag ในการวิเคราะห์ที่เผยแพร่เมื่อต้นสัปดาห์นี้ “มัลแวร์จะลบเนื้อหาของไดเรกทอรีเฉพาะและแก้ไขการกำหนดค่าระบบเพื่อหลีกเลี่ยงการตรวจจับ”</p><p> ห่วงโซ่การติดไวรัสที่มุ่งเป้าไปที่ Hadoop ใช้ประโยชน์จากการกำหนดค่าที่ไม่ถูกต้องใน YARN&#39;s (Yet Another Resource Negotiator) ซึ่งมีหน้าที่รับผิดชอบในการติดตามทรัพยากรในคลัสเตอร์และแอปพลิเคชันการกำหนดเวลา</p><p> โดยเฉพาะอย่างยิ่ง การกำหนดค่าที่ไม่ถูกต้องสามารถถูกโจมตีโดยผู้ดำเนินการภัยคุกคามระยะไกลที่ไม่ได้รับการรับรองความถูกต้อง เพื่อรันโค้ดโดยอำเภอใจโดยใช้คำขอ HTTP ที่สร้างขึ้น โดยขึ้นอยู่กับสิทธิ์ของผู้ใช้บนโหนดที่มีการเรียกใช้โค้ด</p><p> การโจมตีที่มุ่งเป้าไปที่ Apache Flink ก็มุ่งเป้าไปที่การกำหนดค่าที่ไม่ถูกต้องซึ่งทำให้ผู้โจมตีจากระยะไกลสามารถเรียกใช้โค้ดได้โดยไม่มีการตรวจสอบสิทธิ์ใดๆ</p><p> การกำหนดค่าที่ไม่ถูกต้องเหล่านี้ไม่ใช่เรื่องแปลกใหม่และได้รับโดยกลุ่มที่มีแรงจูงใจทางการเงินเช่น TeamTNT ซึ่งเป็นที่รู้จักจากประวัติของการกำหนดเป้าหมายสภาพแวดล้อม Docker และ Kubernetes เพื่อวัตถุประสงค์ในการเข้ารหัสลับและกิจกรรมที่เป็นอันตรายอื่น ๆ</p><p> แต่สิ่งที่ทำให้การโจมตีชุดล่าสุดน่าสังเกตคือการใช้รูทคิทเพื่อซ่อนกระบวนการขุด crypto หลังจากได้รับการตั้งหลักในแอปพลิเคชัน Hadoop และ Flink</p><p> “ผู้โจมตีส่งคำขอที่ไม่ได้รับการรับรองความถูกต้องเพื่อปรับใช้แอปพลิเคชันใหม่” นักวิจัยอธิบาย “ผู้โจมตีสามารถเรียกใช้โค้ดระยะไกลโดยส่งคำขอ POST ไปยัง YARN เพื่อขอเปิดแอปพลิเคชันใหม่ด้วยคำสั่งของผู้โจมตี”</p><p> คำสั่งนี้สร้างขึ้นโดยมีจุดประสงค์เพื่อล้างไดเร็กทอรี /tmp ของเนื้อหาที่มีอยู่ทั้งหมด ดึงไฟล์ชื่อ &quot;dca&quot; จากเซิร์ฟเวอร์ระยะไกล และดำเนินการตามด้วยการลบไฟล์ทั้งหมดในไดเร็กทอรี /tmp อีกครั้ง</p><p> เพย์โหลดที่ดำเนินการนั้นเป็นไบนารี ELF ที่อัดแน่นซึ่งทำหน้าที่เป็นตัวดาวน์โหลดเพื่อดึงรูทคิทสองตัวและไบนารี่ของนักขุดสกุลเงินดิจิทัล Monero เป็นที่น่าสังเกตว่า ซึ่งรวมถึง ได้หันมาใช้เพื่อปกปิดการมีอยู่ของกระบวนการขุดด้วย</p><p> เพื่อให้บรรลุถึงความคงอยู่ งาน cron จึงถูกสร้างขึ้นเพื่อดาวน์โหลดและรันเชลล์สคริปต์ที่ใช้ไบนารี &#39;dca&#39; การวิเคราะห์เพิ่มเติมเกี่ยวกับโครงสร้างพื้นฐานของผู้คุกคามเผยให้เห็นว่าเซิร์ฟเวอร์ชั่วคราวที่ใช้ในการดึงข้อมูลตัวดาวน์โหลดได้รับการลงทะเบียนเมื่อวันที่ 31 ตุลาคม 2023</p><p> เพื่อเป็นการบรรเทาผลกระทบ ขอแนะนำให้องค์กรปรับใช้โซลูชันการรักษาความปลอดภัยแบบใช้เอเจนต์เพื่อตรวจจับตัวขุด cryptominers รูทคิท ไบนารีที่สับสนหรือแพ็ก รวมไปถึงพฤติกรรมรันไทม์ที่น่าสงสัยอื่นๆ</p>"
  },
  {
    "id": "_yudlb972e",
    "category": "Home",
    "title": "Act Now: CISA Flags Active Exploitation of Microsoft SharePoint Vulnerability",
    "date": "Jan 12, 2024",
    "author": "Newsroom",
    "pTags": "Cyber Attack / Vulnerability",
    "imgLinks": [
      "_8en7aa7ne"
    ],
    "contentEn": "<p>The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has  a critical security vulnerability impacting Microsoft SharePoint Server to its Known Exploited Vulnerabilities () catalog, citing evidence of active exploitation.</p><p>The issue, tracked as <strong>CVE-2023-29357</strong> (CVSS score: 9.8), is a privilege escalation flaw that could be exploited by an attacker to gain administrator privileges. Microsoft  for the bug as part of its June 2023 Patch Tuesday updates.</p><p>\"An attacker who has gained access to spoofed JWT authentication tokens can use them to execute a network attack which bypasses authentication and allows them to gain access to the privileges of an authenticated user,\" Redmond said. \"The attacker needs no privileges nor does the user need to perform any action.\"</p><p>Security researcher Nguyễn Tiến Giang (Jang) of StarLabs SG  for the flaw at the Pwn2Own Vancouver hacking contest, earning a $100,000 prize.</p><p>The  combines authentication bypass (CVE-2023–29357) with a code injection bug (, CVSS score: 7.2), the latter of which was patched by Microsoft in May 2023.</p><p>\"The process of discovering and crafting the exploit chain consumed nearly a year of meticulous effort and research to complete the full exploit chain,\" Tiến Giang  in a technical report published in September 2023.</p><p>Additional specifics of the real-world exploitation of CVE-2023–29357 and the identity of the threat actors that may be abusing them are presently unknown. That said, federal agencies are recommended to apply the patches by January 31, 2024, to secure against the active threat.</p>",
    "ref": "https://thehackernews.com/2024/01/act-now-cisa-flags-active-exploitation.html",
    "titleTh": "ดำเนินการทันที: CISA แจ้งว่ามีการใช้ประโยชน์จากช่องโหว่ของ Microsoft SharePoint",
    "contentTh": "<p>หน่วยงานรักษาความปลอดภัยทางไซเบอร์และโครงสร้างพื้นฐานของสหรัฐอเมริกา (CISA) มีช่องโหว่ด้านความปลอดภัยที่สำคัญซึ่งส่งผลกระทบต่อ Microsoft SharePoint Server ไปยังแค็ตตาล็อก Known Exploited Vulnerabilities () โดยอ้างถึงหลักฐานของการแสวงหาผลประโยชน์ที่มีการใช้งานอยู่</p><p> ปัญหาดังกล่าวมีการติดตามในชื่อ <strong>CVE-2023-29357</strong> (คะแนน CVSS: 9.8) ซึ่งเป็นข้อบกพร่องในการยกระดับสิทธิ์ที่ผู้โจมตีอาจนำไปใช้ประโยชน์เพื่อรับสิทธิ์ของผู้ดูแลระบบ Microsoft สำหรับข้อบกพร่องซึ่งเป็นส่วนหนึ่งของการอัปเดต Patch Tuesday เดือนมิถุนายน 2023</p><p> “ผู้โจมตีที่สามารถเข้าถึงโทเค็นการตรวจสอบสิทธิ์ JWT ที่ปลอมแปลงได้ สามารถใช้โทเค็นเหล่านั้นเพื่อดำเนินการโจมตีเครือข่ายซึ่งจะข้ามการตรวจสอบสิทธิ์ และอนุญาตให้พวกเขาเข้าถึงสิทธิ์ของผู้ใช้ที่ได้รับการตรวจสอบสิทธิ์” Redmond กล่าว “ผู้โจมตีไม่ต้องการสิทธิพิเศษ และผู้ใช้ไม่จำเป็นต้องดำเนินการใดๆ”</p><p> นักวิจัยด้านความปลอดภัย Nguyễn Tiến Giang (Jang) จาก StarLabs SG สำหรับข้อบกพร่องในการแข่งขันแฮ็ก Pwn2Own Vancouver ซึ่งได้รับรางวัล 100,000 ดอลลาร์</p><p> การรวมการบายพาสการรับรองความถูกต้อง (CVE-2023–29357) เข้ากับจุดบกพร่องการแทรกโค้ด (, คะแนน CVSS: 7.2) ซึ่งส่วนหลังได้รับการแก้ไขโดย Microsoft ในเดือนพฤษภาคม 2566</p><p> “กระบวนการค้นพบและสร้างห่วงโซ่การหาประโยชน์นั้นใช้ความพยายามและการวิจัยอย่างพิถีพิถันเกือบหนึ่งปีเพื่อทำให้ห่วงโซ่การหาประโยชน์เสร็จสมบูรณ์” Tiến Giang ในรายงานทางเทคนิคที่ตีพิมพ์ในเดือนกันยายน พ.ศ. 2566</p><p> ข้อมูลเฉพาะเพิ่มเติมของการแสวงหาผลประโยชน์ในโลกแห่งความเป็นจริงของ CVE-2023–29357 และตัวตนของผู้คุกคามที่อาจละเมิดพวกเขายังไม่เป็นที่ทราบแน่ชัดในปัจจุบัน อย่างไรก็ตาม หน่วยงานรัฐบาลกลางแนะนำให้ใช้แพตช์ดังกล่าวภายในวันที่ 31 มกราคม 2024 เพื่อป้องกันภัยคุกคามที่ยังดำเนินอยู่</p>"
  }
]