[
  {
    "id": "_nhem3j4v8",
    "category": "Home",
    "title": "Inferno Malware Masqueraded as Coinbase, Drained $87 Million from 137,000 Victims",
    "date": "2024-01-16T13:29:00+05:30",
    "author": "Newsroom",
    "pTags": "Cryptocurrency / Cyber Threat",
    "imgLinks": [
      "_1u5a0ctv3"
    ],
    "contentEn": "<p>The operators behind the now-defunct <strong>Inferno Drainer</strong> created more than 16,000 unique malicious domains over a span of one year between 2022 and 2023.</p><p>The scheme \"leveraged high-quality phishing pages to lure unsuspecting users into connecting their cryptocurrency wallets with the attackers' infrastructure that spoofed Web3 protocols to trick victims into authorizing transactions,\" Singapore-headquartered Group-IB  in a report shared with The Hacker News.</p><p>Inferno Drainer, which was active from , is estimated to have reaped over  by scamming more than 137,000 victims.</p><p>The malware is part of a broader set of similar offerings that are available to affiliates under the scam-as-a-service (or drainer-as-a-service) model in exchange for a 20% cut of their earnings.</p><p>What's more, customers of Inferno Drainer could either upload the malware to their own phishing sites, or make use of the developer's service for creating and hosting phishing websites, either at no extra cost or charging 30% of the stolen assets in some cases.</p><p>According to Group-IB, the activity spoofed upwards of 100 cryptocurrency brands via specially crafted pages that were hosted on over 16,000 unique domains.</p><p>Further analysis of 500 of these domains has revealed that the JavaScript-based drainer was hosted initially on a GitHub repository (kuzdaz.github[.]io/seaport/seaport.js) before incorporating them directly on the websites. The user \"kuzdaz\" currently does not exist.</p><p>In a similar fashion, another set of 350 sites included a JavaScript file, \"coinbase-wallet-sdk.js,\" on a different GitHub repository, \"kasrlorcian.github[.]io.\"</p><p>These sites were then propagated on sites like Discord and X (formerly Twitter), enticing potential victims into clicking them under the guise of offering free tokens (aka airdrops) and connecting their wallets, at which point their assets are drained once the transactions are approved.</p><p>In using the names seaport.js, coinbase.js and wallet-connect.js, the idea was to masquerade as popular Web3 protocols like Seaport, WalletConnect, and Coinbase to complete the unauthorized transactions. The earliest website containing one of these scripts dates back to May 15, 2023.</p><p>\"Another typical feature of phishing websites belonging to Inferno Drainer was that users cannot open website source code by using hotkeys or right-clicking on the mouse,\" Group-IB analyst Viacheslav Shevchenko said. \"This means that the criminals attempted to hide their scripts and illegal activity from their victims.\"</p><p>It's worth noting that Google-owned Mandiant's X account was  earlier this month to distribute links to a phishing page hosting a cryptocurrency drainer tracked as CLINKSINK.</p><p>“We believe that the ‘X as a service’ model will continue to thrive, not least because it creates greater opportunities for less technically competent individuals from trying their hand at becoming cybercriminals, and for developers, it is a highly profitable way to bolster their revenues,” the company told The Hacker News.</p><p>“We also expect to see increased attempts at hacking official accounts, as posts purportedly authored by an authoritative voice are likely to inspire trust in the eyes of viewers, and may make potential victims more likely to follow links and connect their accounts.”</p><p>On top of that, Group-IB said the success of Inferno Drainer could fuel the development of new drainers as well as lead to a surge in websites containing malicious scripts spoofing Web3 protocols, noting 2024 could become the “year of the drainer.”</p><p>\"Inferno Drainer may have ceased its activity, but its prominence throughout 2023 highlights the severe risks to cryptocurrency holders as drainers continue to develop further,\" Andrey Kolmakov, head of Group-IB's High-Tech Crime Investigation Department, said.</p>",
    "ref": "https://thehackernews.com/2024/01/inferno-malware-masqueraded-as-coinbase.html",
    "titleTh": "มัลแวร์ Inferno สวมหน้ากากเป็น Coinbase ระบายเงิน 87 ล้านดอลลาร์จากเหยื่อ 137,000 ราย",
    "contentTh": "<p>ผู้ดำเนินการที่อยู่เบื้องหลัง <strong>Inferno Drainer</strong> ที่เลิกใช้งานไปแล้วได้สร้างโดเมนที่เป็นอันตรายมากกว่า 16,000 โดเมนในช่วงหนึ่งปีระหว่างปี 2022 ถึง 2023</p><p> โครงการ “ใช้ประโยชน์จากหน้าฟิชชิ่งคุณภาพสูงเพื่อล่อลวงผู้ใช้ที่ไม่สงสัยให้เชื่อมต่อกระเป๋าเงินดิจิตอลของพวกเขากับโครงสร้างพื้นฐานของผู้โจมตีที่ปลอมแปลงโปรโตคอล Web3 เพื่อหลอกเหยื่อให้อนุญาตการทำธุรกรรม” Group-IB ซึ่งมีสำนักงานใหญ่ในสิงคโปร์ในรายงานที่แชร์กับ The Hacker News</p><p> Inferno Drainer ซึ่งเริ่มทำงานจาก คาดว่าจะได้ผลโดยการหลอกลวงเหยื่อมากกว่า 137,000 ราย</p><p> มัลแวร์เป็นส่วนหนึ่งของชุดข้อเสนอที่คล้ายกันในวงกว้างซึ่งมีให้บริการสำหรับบริษัทในเครือภายใต้รูปแบบการหลอกลวงแบบบริการ (หรือแบบ Drainer-as-a-Service) เพื่อแลกกับการลดรายได้ลง 20%</p><p> ยิ่งไปกว่านั้น ลูกค้าของ Inferno Drainer ยังสามารถอัปโหลดมัลแวร์ไปยังไซต์ฟิชชิ่งของตนเอง หรือใช้บริการของนักพัฒนาเพื่อสร้างและโฮสต์เว็บไซต์ฟิชชิ่ง โดยไม่มีค่าใช้จ่ายเพิ่มเติมหรือเรียกเก็บเงิน 30% ของทรัพย์สินที่ถูกขโมยในบางกรณี</p><p> ตามข้อมูลของ Group-IB กิจกรรมดังกล่าวเป็นการปลอมแปลงแบรนด์ cryptocurrency กว่า 100 แบรนด์ผ่านเพจที่สร้างขึ้นเป็นพิเศษซึ่งโฮสต์บนโดเมนที่ไม่ซ้ำกันมากกว่า 16,000 โดเมน</p><p> การวิเคราะห์เพิ่มเติมของโดเมนเหล่านี้ 500 โดเมนได้เปิดเผยว่า Drainer ที่ใช้ JavaScript นั้นถูกโฮสต์ครั้งแรกบนที่เก็บ GitHub (kuzdaz.github[.]io/seaport/seaport.js) ก่อนที่จะรวมเข้ากับเว็บไซต์โดยตรง ไม่มีผู้ใช้ &quot;kuzdaz&quot; อยู่ในขณะนี้</p><p> ในทำนองเดียวกัน เว็บไซต์อีกชุดจำนวน 350 แห่งได้รวมไฟล์ JavaScript &quot;coinbase-wallet-sdk.js&quot; ไว้ในที่เก็บ GitHub อื่น &quot;kasrlorcian.github[.]io&quot;</p><p> ไซต์เหล่านี้ได้รับการเผยแพร่บนเว็บไซต์เช่น Discord และ X (เดิมคือ Twitter) เพื่อล่อลวงผู้ที่ตกเป็นเหยื่อให้คลิกพวกเขาภายใต้หน้ากากของการเสนอโทเค็นฟรี (aka airdrops) และเชื่อมต่อกระเป๋าเงินของพวกเขา ซึ่ง ณ จุดนี้ทรัพย์สินของพวกเขาจะหมดลงเมื่อธุรกรรมได้รับการอนุมัติ .</p><p> ในการใช้ชื่อ seaport.js, coinbase.js และ wallet-connect.js แนวคิดคือการปลอมแปลงเป็นโปรโตคอล Web3 ยอดนิยม เช่น Seaport, WalletConnect และ Coinbase เพื่อทำธุรกรรมที่ไม่ได้รับอนุญาตให้เสร็จสิ้น เว็บไซต์แรกสุดที่มีสคริปต์เหล่านี้มีอายุย้อนกลับไปวันที่ 15 พฤษภาคม 2023</p><p> “คุณสมบัติทั่วไปอีกประการหนึ่งของเว็บไซต์ฟิชชิ่งที่เป็นของ Inferno Drainer คือผู้ใช้ไม่สามารถเปิดซอร์สโค้ดของเว็บไซต์ได้โดยใช้ปุ่มลัดหรือคลิกขวาบนเมาส์” นักวิเคราะห์ Group-IB Viacheslav Shevchenko กล่าว “ซึ่งหมายความว่าอาชญากรพยายามซ่อนสคริปต์และกิจกรรมที่ผิดกฎหมายจากเหยื่อ”</p><p> เป็นที่น่าสังเกตว่าบัญชี X ของ Mandiant ที่ Google เป็นเจ้าของนั้นได้เปิดใช้งานเมื่อต้นเดือนนี้เพื่อเผยแพร่ลิงก์ไปยังหน้าฟิชชิ่งที่โฮสต์ตัวระบายสกุลเงินดิจิทัลที่ถูกติดตามในชื่อ CLINKSINK</p><p> “เราเชื่อว่าโมเดล &#39;X as a service&#39; จะยังคงเติบโตต่อไป ไม่น้อยเพราะมันสร้างโอกาสที่มากขึ้นให้กับบุคคลที่มีความสามารถทางเทคนิคน้อยจากการพยายามกลายเป็นอาชญากรไซเบอร์ และสำหรับนักพัฒนา โมเดลนี้เป็นวิธีที่สร้างผลกำไรสูงในการสนับสนุนพวกเขา รายได้” บริษัทบอกกับ The Hacker News</p><p> “เรายังคาดหวังว่าจะเห็นความพยายามเพิ่มขึ้นในการแฮ็กบัญชีอย่างเป็นทางการ เนื่องจากโพสต์ที่อ้างว่าเขียนด้วยเสียงที่เชื่อถือได้มีแนวโน้มที่จะสร้างแรงบันดาลใจให้เกิดความไว้วางใจในสายตาของผู้ดู และอาจทำให้ผู้ที่ตกเป็นเหยื่อมีแนวโน้มที่จะติดตามลิงก์และเชื่อมโยงบัญชีของพวกเขามากขึ้น”</p><p> ยิ่งไปกว่านั้น Group-IB ยังกล่าวอีกว่าความสำเร็จของ Inferno Drainer สามารถกระตุ้นการพัฒนา Drainer ใหม่ได้ รวมถึงนำไปสู่การเพิ่มจำนวนเว็บไซต์ที่มีสคริปต์ที่เป็นอันตรายซึ่งปลอมแปลงโปรโตคอล Web3 โดยสังเกตว่าปี 2024 อาจกลายเป็น “ปีแห่งการระบายน้ำ”</p><p> Andrey Kolmakov หัวหน้าแผนกสืบสวนอาชญากรรมเทคโนโลยีขั้นสูงของ Group-IB กล่าวว่า &quot;Inferno Drainer อาจหยุดกิจกรรมไปแล้ว แต่ความโดดเด่นตลอดปี 2023 เน้นย้ำถึงความเสี่ยงที่รุนแรงต่อผู้ถือครองสกุลเงินดิจิทัล เนื่องจากผู้ระบายน้ำยังคงพัฒนาต่อไป&quot;</p>"
  },
  {
    "id": "_3u1us9tg4",
    "category": "Home",
    "title": "Hackers Weaponize Windows Flaw to Deploy Crypto-Siphoning Phemedrone Stealer",
    "date": "2024-01-16T12:43:00+05:30",
    "author": "Newsroom",
    "pTags": "Cryptocurrency / Windows Security",
    "imgLinks": [
      "_a7kl9nfnj"
    ],
    "contentEn": "<p>Threat actors have been observed leveraging a now-patched security flaw in Microsoft Windows to deploy an open-source information stealer called <strong>Phemedrone Stealer</strong>.</p><p>\"Phemedrone targets web browsers and data from cryptocurrency wallets and messaging apps such as Telegram, Steam, and Discord,\" Trend Micro researchers Peter Girnus, Aliakbar Zahravi, and Simon Zuckerbraun .</p><p>\"It also takes screenshots and gathers system information regarding hardware, location, and operating system details. The stolen data is then sent to the attackers via Telegram or their command-and-control (C&amp;C) server.\"</p><p>The attacks leverage  (CVSS score: 8.8), a security bypass vulnerability in Windows SmartScreen, that could be exploited by tricking a user into clicking on a specially crafted Internet Shortcut (.URL) or a hyperlink pointing to an Internet Shortcut file.</p><p>The actively-exploited shortcoming was  by Microsoft as part of its November 2023 Patch Tuesday updates.</p><p>The infection process involves the threat actor hosting malicious Internet Shortcut files on Discord or cloud services like FileTransfer.io, with the links also masked using URL shorteners such as .</p><p>The execution of the booby-trapped .URL file allows it to connect to an actor-controlled server and execute a control panel (.CPL) file in a manner that circumvents Windows Defender SmartScreen by taking advantage of CVE-2023-36025.</p><p>\"When the malicious .CPL file is executed through the Windows Control Panel process binary, it in turn calls rundll32.exe to execute the DLL,\" the researchers said. \"This malicious DLL acts as a loader that then calls on Windows PowerShell to download and execute the next stage of the attack, hosted on GitHub.\"</p><p>The follow-on payload is a PowerShell loader (\"DATA3.txt\") that acts as a launchpad for , an open-source shellcode loader that decrypts and executes Phemedrone Stealer.</p><p>Written in C#, Phemedrone Stealer is actively maintained by its developers on  and , facilitating the theft of sensitive information from compromised systems.</p><p>The development is once again a sign that threat actors are getting increasingly flexible and quickly adapting their attack chains to capitalize on newly disclosed exploits and inflict maximum damage.</p><p>\"Despite having been patched, threat actors continue to find ways to exploit CVE-2023-36025 and evade Windows Defender SmartScreen protections to infect users with a plethora of malware types, including ransomware and stealers like Phemedrone Stealer,\" the researchers said.</p>",
    "ref": "https://thehackernews.com/2024/01/hackers-weaponize-windows-flaw-to.html",
    "titleTh": "แฮกเกอร์ใช้อาวุธข้อบกพร่องของ Windows เพื่อปรับใช้ Phemedrone Stealer แบบ Crypto-Siphoning",
    "contentTh": "<p>พบว่าผู้คุกคามใช้ประโยชน์จากข้อบกพร่องด้านความปลอดภัยที่ได้รับการติดตั้งแล้วใน Microsoft Windows เพื่อปรับใช้ตัวขโมยข้อมูลโอเพ่นซอร์สที่เรียกว่า <strong>Phemedrone Stealer</strong></p><p> &quot;Phemedrone กำหนดเป้าหมายเว็บเบราว์เซอร์และข้อมูลจากกระเป๋าเงินดิจิทัลและแอปส่งข้อความ เช่น Telegram, Steam และ Discord&quot; นักวิจัยของ Trend Micro Peter Girnus, Aliakbar Zahravi และ Simon Zuckerbraun</p><p> “มันยังจับภาพหน้าจอและรวบรวมข้อมูลระบบเกี่ยวกับฮาร์ดแวร์ ตำแหน่ง และรายละเอียดระบบปฏิบัติการ ข้อมูลที่ถูกขโมยจะถูกส่งไปยังผู้โจมตีผ่านทาง Telegram หรือเซิร์ฟเวอร์คำสั่งและการควบคุม (C&amp;C)”</p><p> การใช้ประโยชน์จากการโจมตี (คะแนน CVSS: 8.8) ซึ่งเป็นช่องโหว่ด้านความปลอดภัยในการเลี่ยงผ่านใน Windows SmartScreen ที่สามารถใช้ประโยชน์ได้โดยการหลอกให้ผู้ใช้คลิกบนทางลัดอินเทอร์เน็ต (.URL) ที่สร้างขึ้นเป็นพิเศษ หรือไฮเปอร์ลิงก์ที่ชี้ไปยังไฟล์ทางลัดอินเทอร์เน็ต</p><p> ข้อบกพร่องที่ถูกใช้ประโยชน์อย่างแข็งขันเกิดขึ้นจาก Microsoft โดยเป็นส่วนหนึ่งของการอัปเดต Patch Tuesday เดือนพฤศจิกายน 2023</p><p> กระบวนการติดไวรัสเกี่ยวข้องกับผู้คุกคามที่โฮสต์ไฟล์ทางลัดอินเทอร์เน็ตที่เป็นอันตรายบน Discord หรือบริการคลาวด์ เช่น FileTransfer.io โดยลิงก์ยังถูกปกปิดโดยใช้ตัวย่อ URL เช่น .</p><p> การดำเนินการของไฟล์ .URL ที่ติดกับดักทำให้สามารถเชื่อมต่อกับเซิร์ฟเวอร์ที่ควบคุมโดยนักแสดงและดำเนินการไฟล์แผงควบคุม (.CPL) ในลักษณะที่หลีกเลี่ยง Windows Defender SmartScreen โดยการใช้ประโยชน์จาก CVE-2023-36025</p><p> “เมื่อไฟล์ .CPL ที่เป็นอันตรายถูกเรียกใช้งานผ่านไบนารีกระบวนการของ Windows Control Panel ไฟล์นั้นจะเรียก rundll32.exe เพื่อรัน DLL” นักวิจัยกล่าว “DLL ที่เป็นอันตรายนี้ทำหน้าที่เป็นตัวโหลดซึ่งจะเรียกใช้ Windows PowerShell เพื่อดาวน์โหลดและดำเนินการโจมตีขั้นต่อไปซึ่งโฮสต์บน GitHub”</p><p> เพย์โหลดที่ตามมาคือตัวโหลด PowerShell (&quot;DATA3.txt&quot;) ที่ทำหน้าที่เป็นแผ่นเปิดใช้สำหรับ ตัวโหลดเชลล์โค้ดแบบโอเพ่นซอร์สที่ถอดรหัสและดำเนินการ Phemedrone Stealer</p><p> Phemedrone Stealer เขียนด้วยภาษา C# ได้รับการดูแลอย่างแข็งขันโดยนักพัฒนาบน และ อำนวยความสะดวกในการขโมยข้อมูลที่ละเอียดอ่อนจากระบบที่ถูกบุกรุก</p><p> การพัฒนาดังกล่าวเป็นสัญญาณอีกครั้งหนึ่งว่าผู้คุกคามเริ่มมีความยืดหยุ่นมากขึ้น และปรับเปลี่ยนห่วงโซ่การโจมตีอย่างรวดเร็วเพื่อใช้ประโยชน์จากช่องโหว่ที่เพิ่งเปิดเผยและสร้างความเสียหายสูงสุด</p><p> “แม้จะได้รับการแก้ไขแล้ว แต่ผู้คุกคามยังคงค้นหาวิธีใช้ประโยชน์จาก CVE-2023-36025 และหลบเลี่ยงการป้องกัน Windows Defender SmartScreen เพื่อแพร่เชื้อผู้ใช้ด้วยมัลแวร์หลายประเภท รวมถึงแรนซัมแวร์และผู้ขโมยเช่น Phemedrone Stealer” นักวิจัยกล่าว</p>"
  }
]