[
  {
    "id": "_ntntiebsd",
    "category": "Home",
    "title": "NIST Warns of Security and Privacy Risks from Rapid AI System Deployment",
    "date": "Jan 08, 2024",
    "author": "Newsroom",
    "pTags": "Artificial Intelligence / Cyber Security",
    "imgLinks": [
      "ai-security.jpg"
    ],
    "contentEn": "\nThe U.S. National Institute of Standards and Technology (NIST) is calling attention to the privacy and security challenges that arise as a result of increased deployment of artificial intelligence (AI) systems in recent years.\n\"These security and privacy challenges include the potential for adversarial manipulation of training data, adversarial exploitation of model vulnerabilities to adversely affect the performance of the AI system, and even malicious manipulations, modifications or mere interaction with models to exfiltrate sensitive information about people represented in the data, about the model itself, or proprietary enterprise data,\" NIST said.\nAs AI systems become integrated into online services at a rapid pace, in part driven by the emergence of generative AI systems like OpenAI ChatGPT and Google Bard, models powering these technologies face a number of threats at various stages of the machine learning operations.\n\nThese include corrupted training data, security flaws in the software components, data model poisoning, supply chain weaknesses, and privacy breaches arising as a result of prompt injection attacks.\n\"For the most part, software developers need more people to use their product so it can get better with exposure,\" NIST computer scientist Apostol Vassilev said. \"But there is no guarantee the exposure will be good. A chatbot can spew out bad or toxic information when prompted with carefully designed language.\"\nThe attacks, which can have significant impacts on availability, integrity, and privacy, are broadly classified as follows -\nEvasion attacks, which aim to generate adversarial output after a model is deployedPoisoning attacks, which target the training phase of the algorithm by introducing corrupted dataPrivacy attacks, which aim to glean sensitive information about the system or the data it was trained on by posing questions that circumvent existing guardrailsAbuse attacks, which aim to compromise legitimate sources of information, such as a web page with incorrect pieces of information, to repurpose the system's intended use\nSuch attacks, NIST said, can be carried out by threat actors with full knowledge (white-box), minimal knowledge (black-box), or have a partial understanding of some of the aspects of the AI system (gray-box).\n\nThe agency further noted the lack of robust mitigation measures to counter these risks, urging the broader tech community to \"come up with better defenses.\"\nThe development arrives more than a month after the U.K., the U.S., and international partners from 16 other countries released guidelines for the development of secure artificial intelligence (AI) systems.\n\"Despite the significant progress AI and machine learning have made, these technologies are vulnerable to attacks that can cause spectacular failures with dire consequences,\" Vassilev said. \"There are theoretical problems with securing AI algorithms that simply haven't been solved yet. If anyone says differently, they are selling snake oil.\"\n\n\n\n",
    "ref": "https://thehackernews.com/2024/01/nist-warns-of-security-and-privacy.html",
    "titleTh": "NIST เตือนถึงความเสี่ยงด้านความปลอดภัยและความเป็นส่วนตัวจากการปรับใช้ระบบ AI อย่างรวดเร็ว",
    "contentTh": "สถาบันมาตรฐานและเทคโนโลยีแห่งชาติของสหรัฐอเมริกา (NIST) เรียกร้องความสนใจไปที่ความท้าทายด้านความเป็นส่วนตัวและความปลอดภัยที่เกิดขึ้นอันเป็นผลมาจากการใช้งานระบบปัญญาประดิษฐ์ (AI) ที่เพิ่มขึ้นในช่วงไม่กี่ปีที่ผ่านมา “ความท้าทายด้านความปลอดภัยและความเป็นส่วนตัวเหล่านี้รวมถึงศักยภาพในการปรับเปลี่ยนข้อมูลการฝึกอบรมโดยฝ่ายตรงข้าม การแสวงหาประโยชน์จากช่องโหว่ของโมเดลที่ส่งผลเสียต่อประสิทธิภาพของระบบ AI และแม้แต่การปรับเปลี่ยนที่เป็นอันตราย การปรับเปลี่ยน หรือเพียงแค่โต้ตอบกับโมเดลเพื่อกรองข้อมูลที่ละเอียดอ่อนเกี่ยวกับบุคคลที่เป็นตัวแทนใน ข้อมูล เกี่ยวกับตัวโมเดลเอง หรือข้อมูลองค์กรที่เป็นกรรมสิทธิ์&quot; NIST กล่าว ในขณะที่ระบบ AI บูรณาการเข้ากับบริการออนไลน์อย่างรวดเร็ว ส่วนหนึ่งได้รับแรงหนุนจากการเกิดขึ้นของระบบ AI ทั่วไป เช่น OpenAI ChatGPT และ Google Bard โมเดลที่ขับเคลื่อนเทคโนโลยีเหล่านี้ต้องเผชิญกับภัยคุกคามหลายประการในขั้นตอนต่างๆ ของการดำเนินการเรียนรู้ของเครื่อง ซึ่งรวมถึงข้อมูลการฝึกอบรมที่เสียหาย ข้อบกพร่องด้านความปลอดภัยในส่วนประกอบซอฟต์แวร์ การเป็นพิษของโมเดลข้อมูล จุดอ่อนของห่วงโซ่อุปทาน และการละเมิดความเป็นส่วนตัวที่เกิดขึ้นจากการโจมตีแบบแทรกแซงทันที Apostol Vassilev นักวิทยาศาสตร์คอมพิวเตอร์ของ NIST กล่าวว่า &quot;โดยส่วนใหญ่ นักพัฒนาซอฟต์แวร์ต้องการให้ผู้คนจำนวนมากขึ้นเพื่อใช้ผลิตภัณฑ์ของตน เพื่อให้สามารถใช้งานได้ดีขึ้น&quot; &quot;แต่ไม่มีการรับประกันว่าการเปิดเผยข้อมูลจะออกมาดี แชทบอทสามารถพ่นข้อมูลที่ไม่ดีหรือเป็นพิษออกมาเมื่อได้รับแจ้งด้วยภาษาที่ออกแบบอย่างระมัดระวัง&quot; การโจมตีซึ่งอาจส่งผลกระทบอย่างมีนัยสำคัญต่อความพร้อมใช้งาน ความสมบูรณ์ และความเป็นส่วนตัว แบ่งประเภทกว้างๆ ได้ดังนี้ - การโจมตีแบบหลบเลี่ยงซึ่งมีจุดมุ่งหมายเพื่อสร้างเอาต์พุตของฝ่ายตรงข้ามหลังจากที่โมเดลถูกปรับใช้ การโจมตีแบบพิษซึ่งกำหนดเป้าหมายไปที่ขั้นตอนการฝึกอบรมของอัลกอริทึมโดยแนะนำการโจมตีความเป็นส่วนตัวของข้อมูลที่เสียหาย ซึ่งมีจุดมุ่งหมายเพื่อรวบรวมข้อมูลที่ละเอียดอ่อนเกี่ยวกับระบบหรือข้อมูลที่ได้รับการฝึกอบรมโดยตั้งคำถามที่ หลีกเลี่ยงรั้วที่มีอยู่ การโจมตีในทางที่ผิดซึ่งมีจุดมุ่งหมายเพื่อประนีประนอมแหล่งข้อมูลที่ถูกต้องตามกฎหมาย เช่น หน้าเว็บที่มีข้อมูลที่ไม่ถูกต้อง เพื่อเปลี่ยนวัตถุประสงค์การใช้งานตามวัตถุประสงค์ของระบบ NIST กล่าวว่าการโจมตีดังกล่าวสามารถดำเนินการโดยผู้คุกคามที่มีความรู้ครบถ้วน (กล่องสีขาว) มีความรู้เพียงเล็กน้อย (กล่องดำ) หรือมีความเข้าใจบางส่วนเกี่ยวกับบางแง่มุมของระบบ AI (กล่องสีเทา) หน่วยงานยังตั้งข้อสังเกตอีกว่าการขาดมาตรการบรรเทาผลกระทบที่แข็งแกร่งเพื่อรับมือกับความเสี่ยงเหล่านี้ โดยเรียกร้องให้ชุมชนเทคโนโลยีในวงกว้าง &quot;สร้างการป้องกันที่ดีขึ้น&quot; การพัฒนาดังกล่าวเกิดขึ้นมากกว่าหนึ่งเดือนหลังจากที่สหราชอาณาจักร สหรัฐอเมริกา และพันธมิตรระหว่างประเทศจาก 16 ประเทศอื่น ๆ ได้เผยแพร่แนวปฏิบัติสำหรับการพัฒนาระบบปัญญาประดิษฐ์ (AI) ที่ปลอดภัย “แม้ว่า AI และการเรียนรู้ของเครื่องจักรจะมีความก้าวหน้าอย่างมาก แต่เทคโนโลยีเหล่านี้ก็มีความเสี่ยงที่จะถูกโจมตีซึ่งอาจทำให้เกิดความล้มเหลวอย่างน่าทึ่งและส่งผลร้ายแรง” Vassilev กล่าว “มีปัญหาทางทฤษฎีเกี่ยวกับการรักษาความปลอดภัยอัลกอริธึม AI ที่ยังไม่ได้รับการแก้ไข ถ้าใครพูดแตกต่างออกไป พวกเขากำลังขายน้ำมันงู”"
  },
  {
    "id": "_jqv7wfa2i",
    "category": "Home",
    "title": "DoJ Charges 19 Worldwide in $68 Million xDedic Dark Web Marketplace Fraud",
    "date": "Jan 08, 2024",
    "author": "Newsroom",
    "pTags": "Financial Fraud / Cybercrime",
    "imgLinks": [
      "hacked.jpg"
    ],
    "contentEn": "\nThe U.S. Department of Justice (DoJ) said it charged 19 individuals worldwide in connection with the now-defunct xDedic Marketplace, which is estimated to have facilitated more than $68 million in fraud.\nIn wrapping up its investigation into the dark web portal, the agency said the transnational operation was the result of close cooperation with law enforcement authorities from Belgium, Germany, the Netherlands, Ukraine, and Europol.\nOf the 19 defendants, three have been sentenced to 6.5 years in prison, eight have been awarded jail terms ranging from one year to five years, and one individual has been ordered to serve five years' probation.\nOne among them includes Glib Oleksandr Ivanov-Tolpintsev, a Ukrainian national who was sentenced to four years in prison in May 2022 for selling compromised credentials on xDedic and making $82,648 in illegal profits.\n\nDariy Pankov, described by the DoJ as one of the highest sellers by volume, offered credentials of no less than 35,000 hacked servers located all over the world and obtaining more than $350,000 in illicit proceeds.\nThe servers were infiltrated using a custom tool named NLBrute that was capable of breaking into protected computers by decrypting login credentials.\nAlso of note is a Nigerian national named Allen Levinson, who was a \"prolific buyer\" with a particular interest in purchasing access to U.S.-based Certified Public Accounting firms in order to file bogus tax returns with the U.S. government.\nFive others, who have been accused of a conspiracy to commit wire fraud, are pending sentencing.\nAlongside these administrators and sellers, two buyers named Olufemi Odedeyi and Oluwaseyi Shodipe have been charged with conspiracy to commit wire fraud and aggravated identity theft. Shodipe has also been charged with making false claims and theft of government funds.\nBoth individuals are yet to be extradited from the U.K. If convicted, they each face a maximum penalty of 20 years in federal prison.\n\nThe marketplace, until its takedown in January 2019, allowed cybercriminals to buy or sell stolen credentials to more than 700,000 hacked computers and servers across the world and personally identifiable information of U.S. residents, such as dates of birth and Social Security numbers.\nAlexandru Habasescu and Pavlo Kharmanskyi functioned as the marketplace's administrators. Habasescu, from Moldova, was the lead developer, while Kharmanskyi, who lived in Ukraine, managed advertising, payments, and customer support to buyers.\n\"Once purchased, criminals used these servers to facilitate a wide range of illegal activity that included tax fraud and ransomware attacks,\" the DoJ said.\nTargets of these attacks comprised government infrastructure, hospitals, 911 and emergency services, call centers, major metropolitan transit authorities, accounting and law firms, pension funds, and universities.\n\n\n\n",
    "ref": "https://thehackernews.com/2024/01/doj-charges-19-worldwide-in-68-million.html",
    "titleTh": "DoJ เรียกเก็บเงิน 19 รายทั่วโลกในการฉ้อโกง xDedic Dark Web Marketplace มูลค่า 68 ล้านดอลลาร์",
    "contentTh": "กระทรวงยุติธรรมสหรัฐฯ (DoJ) กล่าวว่าได้เรียกเก็บเงินบุคคล 19 รายทั่วโลกที่เกี่ยวข้องกับ xDedic Marketplace ซึ่งขณะนี้ปิดให้บริการแล้ว ซึ่งคาดว่าจะมีส่วนช่วยในการฉ้อโกงมากกว่า 68 ล้านดอลลาร์ ในการสรุปการสืบสวนพอร์ทัลมืดนี้ หน่วยงานกล่าวว่าการดำเนินการข้ามชาติเป็นผลมาจากความร่วมมืออย่างใกล้ชิดกับหน่วยงานบังคับใช้กฎหมายจากเบลเยียม เยอรมนี เนเธอร์แลนด์ ยูเครน และ Europol จากจำเลย 19 คน มี 3 คนถูกตัดสินจำคุก 6.5 ปี 8 คนได้รับโทษจำคุกตั้งแต่ 1 ปีถึง 5 ปี และอีก 1 คนได้รับคำสั่งให้รับโทษจำคุก 5 ปี หนึ่งในนั้นได้แก่ Glib Oleksandr Ivanov-Tolpintsev ชาวยูเครนที่ถูกตัดสินจำคุกสี่ปีในเดือนพฤษภาคม 2022 จากการขายข้อมูลประจำตัวที่ถูกบุกรุกบน xDedic และสร้างรายได้ 82,648 ดอลลาร์จากผลกำไรที่ผิดกฎหมาย Dariy Pankov ซึ่ง DoJ อธิบายว่าเป็นหนึ่งในผู้ขายสูงสุดเมื่อพิจารณาจากปริมาณ เสนอข้อมูลรับรองเซิร์ฟเวอร์ที่ถูกแฮ็กไม่ต่ำกว่า 35,000 แห่งทั่วโลก และได้รับรายได้ที่ผิดกฎหมายมากกว่า 350,000 ดอลลาร์ เซิร์ฟเวอร์ถูกแทรกซึมโดยใช้เครื่องมือแบบกำหนดเองชื่อ NLBrute ซึ่งสามารถเจาะเข้าไปในคอมพิวเตอร์ที่ได้รับการป้องกันโดยการถอดรหัสข้อมูลรับรองการเข้าสู่ระบบ สิ่งที่น่าสังเกตอีกอย่างคือชาวไนจีเรียชื่อ Allen Levinson ซึ่งเป็น &quot;ผู้ซื้อที่มีจำนวนมาก&quot; โดยมีความสนใจเป็นพิเศษในการซื้อการเข้าถึงบริษัทบัญชีสาธารณะที่ได้รับการรับรองซึ่งมีฐานอยู่ในสหรัฐฯ เพื่อยื่นแบบแสดงรายการภาษีปลอมกับรัฐบาลสหรัฐฯ อีกห้าคนที่ถูกกล่าวหาว่าสมรู้ร่วมคิดในการฉ้อโกงทางสายกำลังรอการพิจารณาโทษ นอกจากผู้ดูแลระบบและผู้ขายแล้ว ผู้ซื้อสองรายชื่อ Olufemi Odedeyi และ Oluwaseyi Shodipe ยังถูกตั้งข้อหาสมรู้ร่วมคิดในการฉ้อโกงทางสายและการขโมยข้อมูลระบุตัวตนที่ร้ายแรงอีกด้วย Shodipe ยังถูกตั้งข้อหาทำการกล่าวอ้างอันเป็นเท็จและขโมยเงินของรัฐบาล บุคคลทั้งสองยังไม่ถูกส่งตัวข้ามแดนจากสหราชอาณาจักร หากถูกตัดสินว่ามีความผิด แต่ละคนจะถูกลงโทษสูงสุด 20 ปีในเรือนจำกลาง ตลาดจนกระทั่งถูกลบออกในเดือนมกราคม 2019 อนุญาตให้อาชญากรไซเบอร์ซื้อหรือขายข้อมูลประจำตัวที่ถูกขโมยไปยังคอมพิวเตอร์และเซิร์ฟเวอร์ที่ถูกแฮ็กมากกว่า 700,000 เครื่องทั่วโลก และข้อมูลระบุตัวบุคคลของผู้อยู่อาศัยในสหรัฐอเมริกา เช่น วันเกิดและหมายเลขประกันสังคม Alexandru Habasescu และ Pavlo Kharmanskyi ทำหน้าที่เป็นผู้ดูแลตลาด Habasescu จากมอลโดวาเป็นหัวหน้านักพัฒนา ในขณะที่ Kharmanskyi ซึ่งอาศัยอยู่ในยูเครน จัดการโฆษณา การชำระเงิน และการสนับสนุนลูกค้าให้กับผู้ซื้อ “เมื่อซื้อแล้ว อาชญากรจะใช้เซิร์ฟเวอร์เหล่านี้เพื่ออำนวยความสะดวกในกิจกรรมที่ผิดกฎหมายที่หลากหลาย ซึ่งรวมถึงการฉ้อโกงภาษีและการโจมตีแรนซัมแวร์” DoJ กล่าว เป้าหมายของการโจมตีเหล่านี้ประกอบด้วยโครงสร้างพื้นฐานของรัฐบาล โรงพยาบาล หน่วย 911 และบริการฉุกเฉิน ศูนย์บริการทางโทรศัพท์ หน่วยงานขนส่งมวลชนหลักๆ สำนักงานบัญชีและกฎหมาย กองทุนบำเหน็จบำนาญ และมหาวิทยาลัย"
  },
  {
    "id": "_4j8p7vyfr",
    "category": "Home",
    "title": "North Korea's Cyber Heist: DPRK Hackers Stole $600 Million in Cryptocurrency in 2023",
    "date": "Jan 08, 2024",
    "author": "Newsroom",
    "pTags": "Cryptocurrency / Financial Crime",
    "imgLinks": [
      "hack.jpg"
    ],
    "contentEn": "\nThreat actors affiliated with the Democratic People's Republic of Korea (also known as North Korea) have plundered at least $600 million in cryptocurrency in 2023.\nThe DPRK \"was responsible for almost a third of all funds stolen in crypto attacks last year, despite a 30% reduction from the USD 850 million haul in 2022,\" blockchain analytics firm TRM Labs said last week.\n\"Hacks perpetrated by the DPRK were on average ten times as damaging as those not linked to North Korea.\"\n\nThere are indications that additional breaches targeting the crypto sector towards the end of 2023 could push this figure higher to around $700 million.\nThe targeting of cryptocurrency companies is not new for North Korean state-sponsored actors, who have stolen about $3 billion since 2017.\nThese financially motivated attacks are seen as a crucial revenue-generation mechanism for the sanctions-hit nation, funding its weapons of mass destruction (WMD) and ballistic missile programs.\n\nThe intrusions leverage social engineering to lure targets and typically aim to compromise private keys and seed phrases – which are used to safeguard digital wallets – and then use them to gain unauthorized access to the victims' assets and transfer them to wallets under the threat actor's control.\n\"They are then swapped mostly for USDT or Tron and converted to hard currency using high-volume OTC brokers,\" TRM Labs said.\n\nThe company further noted that DPRK hackers continued to explore other money laundering tools after the U.S. Treasury Department sanctioned a crypto mixer service known as Sinbad for processing a chunk of their proceeds, indicating constant evolution despite law enforcement pressure.\n\"With nearly USD 1.5 billion stolen in the past two years alone, North Korea's hacking prowess demands continuous vigilance and innovation from business and governments,\" TRM Labs said.\n\n\n\n\n",
    "ref": "https://thehackernews.com/2024/01/north-koreas-cyber-heist-dprk-hackers.html",
    "titleTh": "การปล้นทางไซเบอร์ของเกาหลีเหนือ: แฮกเกอร์ DPRK ขโมย Cryptocurrency มูลค่า 600 ล้านดอลลาร์ในปี 2023",
    "contentTh": "ผู้คุกคามที่เกี่ยวข้องกับสาธารณรัฐประชาธิปไตยประชาชนเกาหลี (หรือที่เรียกว่าเกาหลีเหนือ) ได้ปล้นเงินดิจิทัลอย่างน้อย 600 ล้านดอลลาร์ในปี 2566 DPRK “ต้องรับผิดชอบต่อเงินเกือบหนึ่งในสามของเงินทุนทั้งหมดที่ถูกขโมยจากการโจมตีของ crypto เมื่อปีที่แล้ว แม้ว่าจะลดลง 30% จากการดึงเงิน 850 ล้านเหรียญสหรัฐในปี 2022” บริษัทวิเคราะห์บล็อคเชน TRM Labs กล่าวเมื่อสัปดาห์ที่แล้ว “การแฮ็กที่ DPRK กระทำนั้นสร้างความเสียหายโดยเฉลี่ยสิบเท่าเมื่อเทียบกับการไม่เชื่อมโยงกับเกาหลีเหนือ” มีข้อบ่งชี้ว่าการละเมิดเพิ่มเติมที่มุ่งเป้าไปที่ภาค crypto ในช่วงสิ้นปี 2566 อาจทำให้ตัวเลขนี้สูงขึ้นเป็นประมาณ 700 ล้านดอลลาร์ การกำหนดเป้าหมายของบริษัท cryptocurrency ไม่ใช่เรื่องใหม่สำหรับนักแสดงที่ได้รับการสนับสนุนจากรัฐเกาหลีเหนือ ซึ่งขโมยเงินไปประมาณ 3 พันล้านดอลลาร์ตั้งแต่ปี 2017 การโจมตีที่มีแรงจูงใจทางการเงินเหล่านี้ถูกมองว่าเป็นกลไกการสร้างรายได้ที่สำคัญสำหรับประเทศที่ถูกคว่ำบาตร โดยให้ทุนสนับสนุนโครงการอาวุธทำลายล้างสูง (WMD) และโครงการขีปนาวุธ การบุกรุกใช้ประโยชน์จากวิศวกรรมสังคมเพื่อล่อเป้าหมายและโดยทั่วไปมุ่งเป้าไปที่การประนีประนอมคีย์ส่วนตัวและวลีเริ่มต้นซึ่งใช้เพื่อปกป้องกระเป๋าเงินดิจิทัล จากนั้นใช้มันเพื่อเข้าถึงทรัพย์สินของเหยื่อโดยไม่ได้รับอนุญาต และโอนไปยังกระเป๋าเงินภายใต้การควบคุมของผู้คุกคาม . “จากนั้นส่วนใหญ่จะเปลี่ยนเป็น USDT หรือ Tron และแปลงเป็นสกุลเงินแข็งโดยใช้โบรกเกอร์ OTC ที่มีปริมาณสูง” TRM Labs กล่าว บริษัทตั้งข้อสังเกตเพิ่มเติมว่าแฮกเกอร์ DPRK ยังคงสำรวจเครื่องมือฟอกเงินอื่น ๆ ต่อไป หลังจากที่กระทรวงการคลังของสหรัฐฯ คว่ำบาตรบริการผสม crypto ที่รู้จักกันในชื่อ Sinbad เพื่อประมวลผลรายได้ส่วนหนึ่ง ซึ่งบ่งบอกถึงการพัฒนาอย่างต่อเนื่องแม้จะมีแรงกดดันจากการบังคับใช้กฎหมายก็ตาม “ด้วยการขโมยเงินเกือบ 1.5 พันล้านดอลลาร์ในช่วงสองปีที่ผ่านมา ความสามารถในการแฮ็กข้อมูลของเกาหลีเหนือต้องการการเฝ้าระวังและนวัตกรรมอย่างต่อเนื่องจากภาคธุรกิจและรัฐบาล” TRM Labs กล่าว"
  },
  {
    "id": "_shnr22ou5",
    "category": "Home",
    "title": "Webinar – Leverage Zero Trust Security to Minimize Your Attack Surface",
    "date": "Jan 08, 2024",
    "author": "Newsroom",
    "pTags": "Cyber Security / Zero Trust",
    "imgLinks": [
      "zz.jpg"
    ],
    "contentEn": "\nDigital expansion inevitably increases the external attack surface, making you susceptible to cyberthreats. Threat actors increasingly exploit the vulnerabilities stemming from software and infrastructure exposed to the internet; this ironically includes security tools, particularly firewalls and VPNs, which give attackers direct network access to execute their attacks. In fact, Gartner identified attack surface expansion as a major trend to watch.\nSo, it is not surprising that External Attack Surface Management (EASM) is a growing priority for organizations. But traditional castle-and-moat-based security architectures are ineffective at protecting enterprises against today's sophisticated attacks, which increasingly leverage AI and as-a-service models to maximize speed and damage.\nZero trust security is the best way to minimize the attack surface, prevent compromise, eliminate lateral movement, and stop data loss.\nRegister here and join Apoorva Ravikrishnan, Senior Manager of Product Marketing, to learn:\n\nThe most prominent trends in today's attack landscape\nHow attackers discover and exploit infrastructure as part of their attack sequence\nHow to leverage zero trust security to minimize your attack surface\n  .webi-a-box{ background-color: #f6f7fd; padding: 25px; border-radius: 10px; } .webi-a-box h2 { color: #333; margin-top: 0; } .webi-a-box .cta-button { display: inline-block; margin-top: 20px; padding: 10px 20px; background-color: #4469f5; color: #ffffff !important; border-radius: 5px; text-decoration: none; transition: background-color 0.3s ease; }  \nLeverage Zero Trust Security to Minimize your Attack Surface#\nReady to harness the power of zero trust security to minimize your organization's attack surface? Join our insightful webinar with Zscaler to learn how to tackle an ever-evolving attack surface.\nReserve Your Webinar Spot ➜ \n\nWhy attend? #\nThis will not be the first time you might have come across a webinar on minimizing the attack surface. Shadow IT, public cloud web apps, increased usage of open source code, unsecured servers running RDP/VNC/SSH/Telnet/SNMP, IoT systems with legacy services, TLS/SSL misconfigurations, and vulnerable remote access systems like VPNs – all increase the attack surface. In truth, many of you would be thinking about reducing your attack surface daily. However, this is an excellent opportunity to hear about how even security tools such as VPNs and Firewalls increase your attack surface and what you can do about it.\n\nUnderstand how to take control of your digital footprint to reduce your external attack surface.\nGet to know why traditional security architecture is not built for digital transformation.\nUnderstand more about User-to-App segmentation for granular access and risk reduction.\nGet actionable insights from Zscaler – the world's largest security cloud and a pioneer in Zero Trust architecture.\n\nTap into our security expertise to learn more about leveraging Zero Trust to minimize attack surfaces and keep your data, applications, and users secure. Register for the webinar here.\n\n\n\n",
    "ref": "https://thehackernews.com/2024/01/webinar-leverage-zero-trust-security-to.html",
    "titleTh": "การสัมมนาออนไลน์ – ใช้ประโยชน์จาก Zero Trust Security เพื่อลดพื้นที่การโจมตีของคุณ",
    "contentTh": "การขยายตัวทางดิจิทัลจะเพิ่มพื้นที่การโจมตีจากภายนอกอย่างหลีกเลี่ยงไม่ได้ ทำให้คุณเสี่ยงต่อภัยคุกคามทางไซเบอร์ ผู้คุกคามใช้ประโยชน์จากช่องโหว่ที่เกิดจากซอฟต์แวร์และโครงสร้างพื้นฐานที่เปิดเผยต่ออินเทอร์เน็ตเพิ่มมากขึ้น ซึ่งรวมถึงเครื่องมือรักษาความปลอดภัย โดยเฉพาะไฟร์วอลล์และ VPN ซึ่งช่วยให้ผู้โจมตีเข้าถึงเครือข่ายได้โดยตรงเพื่อดำเนินการโจมตี ในความเป็นจริง Gartner ระบุว่าการขยายพื้นที่การโจมตีเป็นแนวโน้มหลักที่น่าจับตามอง ดังนั้นจึงไม่น่าแปลกใจที่การจัดการพื้นผิวการโจมตีภายนอก (EASM) มีความสำคัญเพิ่มมากขึ้นสำหรับองค์กร แต่สถาปัตยกรรมความปลอดภัยแบบปราสาทและคูน้ำแบบดั้งเดิมนั้นไม่ได้ผลในการปกป้ององค์กรจากการโจมตีที่ซับซ้อนในปัจจุบัน ซึ่งใช้ประโยชน์จากโมเดล AI และ as-a-service มากขึ้นเพื่อเพิ่มความเร็วและความเสียหายสูงสุด การรักษาความปลอดภัยแบบ Zero Trust เป็นวิธีที่ดีที่สุดในการลดพื้นที่การโจมตี ป้องกันการประนีประนอม กำจัดการเคลื่อนไหวด้านข้าง และหยุดการสูญเสียข้อมูล ลงทะเบียนที่นี่และร่วมงานกับ Apoorva Ravikrishnan ผู้จัดการอาวุโสฝ่ายการตลาดผลิตภัณฑ์ เพื่อเรียนรู้: แนวโน้มที่โดดเด่นที่สุดในแนวการโจมตีในปัจจุบัน วิธีที่ผู้โจมตีค้นพบและใช้ประโยชน์จากโครงสร้างพื้นฐานโดยเป็นส่วนหนึ่งของลำดับการโจมตี วิธีใช้ประโยชน์จากการรักษาความปลอดภัยแบบ Zero Trust เพื่อลดพื้นที่การโจมตีของคุณ .webi-a-box{ สีพื้นหลัง: #f6f7fd; ช่องว่างภายใน: 25px; รัศมีเส้นขอบ: 10px; } .webi-a-box h2 { สี: #333; ขอบด้านบน: 0; } .webi-a-box .cta-button { จอแสดงผล: อินไลน์บล็อก; ขอบบน: 20px; การขยาย: 10px 20px; สีพื้นหลัง: #4469f5; สี: #ffffff !สำคัญ; รัศมีเส้นขอบ: 5px; การตกแต่งข้อความ: ไม่มี; การเปลี่ยนแปลง: สีพื้นหลัง 0.3 วินาที; } ใช้ประโยชน์จาก Zero Trust Security เพื่อลดการโจมตีของคุณ# พร้อมที่จะควบคุมพลังของการรักษาความปลอดภัยแบบ Zero Trust เพื่อลดพื้นที่การโจมตีขององค์กรของคุณแล้วหรือยัง? เข้าร่วมการสัมมนาผ่านเว็บเชิงลึกของเรากับ Zscaler เพื่อเรียนรู้วิธีรับมือกับพื้นผิวการโจมตีที่พัฒนาอยู่ตลอดเวลา จองจุดสัมมนาออนไลน์ของคุณ ➜ ทำไมต้องเข้าร่วม? # นี่ไม่ใช่ครั้งแรกที่คุณอาจพบกับการสัมมนาผ่านเว็บเกี่ยวกับการลดพื้นที่การโจมตี Shadow IT, เว็บแอปบนคลาวด์สาธารณะ, การใช้งานโค้ดโอเพ่นซอร์สที่เพิ่มขึ้น, เซิร์ฟเวอร์ที่ไม่ปลอดภัยที่ใช้ RDP/VNC/SSH/Telnet/SNMP, ระบบ IoT พร้อมบริการแบบเดิม, การกำหนดค่า TLS/SSL ไม่ถูกต้อง และระบบการเข้าถึงระยะไกลที่มีช่องโหว่ เช่น VPN ทั้งหมดนี้ช่วยเพิ่ม พื้นผิวการโจมตี จริงๆ แล้ว หลายๆ คนคงคิดที่จะลดพื้นที่การโจมตีของคุณลงทุกวัน อย่างไรก็ตาม นี่เป็นโอกาสอันดีที่จะได้ทราบว่าแม้แต่เครื่องมือรักษาความปลอดภัย เช่น VPN และไฟร์วอลล์ยังช่วยเพิ่มพื้นที่การโจมตีของคุณได้อย่างไร และคุณสามารถทำอะไรได้บ้าง ทำความเข้าใจวิธีควบคุมรอยเท้าดิจิทัลของคุณเพื่อลดการโจมตีจากภายนอก ทำความเข้าใจว่าเหตุใดสถาปัตยกรรมความปลอดภัยแบบดั้งเดิมจึงไม่ถูกสร้างขึ้นสำหรับการเปลี่ยนแปลงทางดิจิทัล ทำความเข้าใจเพิ่มเติมเกี่ยวกับการแบ่งส่วนผู้ใช้กับแอปเพื่อการเข้าถึงแบบละเอียดและการลดความเสี่ยง รับข้อมูลเชิงลึกที่นำไปปฏิบัติได้จาก Zscaler ซึ่งเป็นระบบคลาวด์รักษาความปลอดภัยที่ใหญ่ที่สุดในโลกและผู้บุกเบิกสถาปัตยกรรม Zero Trust ใช้ประโยชน์จากความเชี่ยวชาญด้านความปลอดภัยของเราเพื่อเรียนรู้เพิ่มเติมเกี่ยวกับการใช้ประโยชน์จาก Zero Trust เพื่อลดพื้นที่การโจมตีและรักษาข้อมูล แอปพลิเคชัน และผู้ใช้ของคุณให้ปลอดภัย ลงทะเบียนสำหรับการสัมมนาผ่านเว็บที่นี่"
  },
  {
    "id": "_vy6c7ihfi",
    "category": "Home",
    "title": "Beware! YouTube Videos Promoting Cracked Software Distribute Lumma Stealer",
    "date": "Jan 09, 2024",
    "author": "Newsroom",
    "pTags": "Malware / Cyber Threat",
    "imgLinks": [
      "youtube.jpg"
    ],
    "contentEn": "\nThreat actors are resorting to YouTube videos featuring content related to cracked software in order to entice users into downloading an information stealer malware called Lumma.\n\"These YouTube videos typically feature content related to cracked applications, presenting users with similar installation guides and incorporating malicious URLs often shortened using services like TinyURL and Cuttly,\" Fortinet FortiGuard Labs researcher Cara Lin said in a Monday analysis.\nThis is not the first time pirated software videos on YouTube have emerged as an effective bait for stealer malware. Previously similar attack chains were observed delivering stealers, clippers, and crypto miner malware.\n\nIn doing so, threat actors can leverage the compromised machines for not only information and cryptocurrency theft, but also abuse the resources for illicit mining.\nIn the latest attack sequence documented by Fortinet, users searching for cracked versions of legitimate video editing tools like Vegas Pro on YouTube are prompted to click on a link located in the video's description, leading to the download of a bogus installer hosted on MediaFire.\n\nThe ZIP installer, once unpacked, features a Windows shortcut (LNK) masquerading as a setup file that downloads a .NET loader from a GitHub repository, which, in turn, loads the stealer payload, but not before performing a series of anti-virtual machine and anti-debugging checks.\nLumma Stealer, written in C and offered for sale on underground forums since late 2022, is capable of harvesting and exfiltrating sensitive data to an actor-controlled server.\nThe development comes as Bitdefender warned of stream-jacking attacks on YouTube in which cybercriminals take over high-profile accounts via phishing attacks that deploy the RedLine Stealer malware to siphon their credentials and session cookies, and ultimately promote various crypto scams.\n\nIt also follows the discovery of an 11-month-old AsyncRAT campaign that employs phishing lures to download an obfuscated JavaScript file that's then utilized to drop the remote access trojan.\n\"The victims and their companies are carefully selected to broaden the impact of the campaign,\" AT&T Alien Labs researcher Fernando Martinez said. \"Some of the identified targets manage key infrastructure in the U.S.\"\n\n\n\n",
    "ref": "https://thehackernews.com/2024/01/beware-youtube-videos-promoting-cracked.html",
    "titleTh": "ระวัง! วิดีโอ YouTube ที่โปรโมตซอฟต์แวร์แคร็กแจกจ่าย Lumma Stealer",
    "contentTh": "ผู้คุกคามหันไปดูวิดีโอ YouTube ที่มีเนื้อหาเกี่ยวกับซอฟต์แวร์ถอดรหัสเพื่อดึงดูดผู้ใช้ให้ดาวน์โหลดมัลแวร์ขโมยข้อมูลที่เรียกว่า Lumma “วิดีโอ YouTube เหล่านี้มักมีเนื้อหาที่เกี่ยวข้องกับแอพพลิเคชั่นที่ถอดรหัส โดยนำเสนอผู้ใช้ด้วยคำแนะนำในการติดตั้งที่คล้ายกัน และรวม URL ที่เป็นอันตรายซึ่งมักจะถูกทำให้สั้นลงเมื่อใช้บริการเช่น TinyURL และ Cuttly” Cara Lin นักวิจัยของ Fortinet FortiGuard Labs กล่าวในการวิเคราะห์เมื่อวันจันทร์ นี่ไม่ใช่ครั้งแรกที่วิดีโอซอฟต์แวร์ละเมิดลิขสิทธิ์บน YouTube กลายเป็นเหยื่อล่อมัลแวร์ที่มีประสิทธิภาพ ก่อนหน้านี้พบว่ามีการโจมตีแบบลูกโซ่ที่ส่งผู้ขโมย คลิปเปอร์ และมัลแวร์ตัวขุดคริปโต ในการทำเช่นนั้น ผู้คุกคามสามารถใช้ประโยชน์จากเครื่องที่ถูกบุกรุกไม่เพียงแต่ข้อมูลและการขโมยสกุลเงินดิจิทัลเท่านั้น แต่ยังใช้ทรัพยากรในทางที่ผิดสำหรับการขุดที่ผิดกฎหมายอีกด้วย ในลำดับการโจมตีล่าสุดที่จัดทำโดย Fortinet ผู้ใช้ที่ค้นหาเครื่องมือตัดต่อวิดีโอที่ถูกต้องตามกฎหมายเช่น Vegas Pro บน YouTube จะได้รับแจ้งให้คลิกลิงก์ที่อยู่ในคำอธิบายของวิดีโอ ซึ่งจะนำไปสู่การดาวน์โหลดตัวติดตั้งปลอมที่โฮสต์บน MediaFire เมื่อคลายแพ็กตัวติดตั้ง ZIP แล้ว จะมีทางลัด Windows (LNK) ปลอมตัวเป็นไฟล์ติดตั้งที่ดาวน์โหลดไฟล์ .NET จากที่เก็บ GitHub ซึ่งในทางกลับกันจะโหลดเพย์โหลดของผู้ขโมย แต่ไม่ใช่ก่อนที่จะดำเนินการชุดต่อต้านเสมือน การตรวจสอบเครื่องจักรและการป้องกันการดีบัก Lumma Stealer ซึ่งเขียนด้วยภาษา C และเสนอขายในฟอรัมใต้ดินตั้งแต่ปลายปี 2022 สามารถเก็บเกี่ยวและกรองข้อมูลที่ละเอียดอ่อนไปยังเซิร์ฟเวอร์ที่ควบคุมโดยนักแสดง การพัฒนาดังกล่าวเกิดขึ้นเมื่อ Bitdefender เตือนถึงการโจมตีแบบสตรีมแจ็คบน YouTube ซึ่งอาชญากรไซเบอร์เข้าครอบครองบัญชีที่มีโปรไฟล์สูงผ่านการโจมตีแบบฟิชชิ่งที่ใช้มัลแวร์ RedLine Stealer เพื่อดูดข้อมูลประจำตัวและคุกกี้เซสชันของพวกเขา และท้ายที่สุดก็ส่งเสริมการหลอกลวง crypto ต่างๆ นอกจากนี้ยังติดตามการค้นพบแคมเปญ AsyncRAT อายุ 11 เดือนที่ใช้เหยื่อฟิชชิ่งเพื่อดาวน์โหลดไฟล์ JavaScript ที่สร้างความสับสน จากนั้นจะถูกใช้ในการปล่อยโทรจันการเข้าถึงระยะไกล “เหยื่อและบริษัทของพวกเขาได้รับการคัดเลือกอย่างรอบคอบเพื่อขยายผลกระทบของการรณรงค์” เฟอร์นันโด มาร์ติเนซ นักวิจัยของ AT&amp;T Alien Labs กล่าว &quot;เป้าหมายที่ระบุบางส่วนจัดการโครงสร้างพื้นฐานที่สำคัญในสหรัฐอเมริกา&quot;"
  }
]