[
  {
    "id": "_sctupqhju",
    "title": "Alert: Ivanti Releases Patch for Critical Vulnerability in Endpoint Manager Solution",
    "date": "Jan 05, 2024",
    "author": "Newsroom",
    "pTags": "Vulnerability / Network Security",
    "imgLinks": [
      "ivanti.jpg"
    ],
    "contentEn": "\nIvanti has released security updates to address a critical flaw impacting its Endpoint Manager (EPM) solution that, if successfully exploited, could result in remote code execution (RCE) on susceptible servers.\nTracked as CVE-2023-39336, the vulnerability has been rated 9.6 out of 10 on the CVSS scoring system. The shortcoming impacts EPM 2021 and EPM 2022 prior to SU5.\n\"If exploited, an attacker with access to the internal network can leverage an unspecified SQL injection to execute arbitrary SQL queries and retrieve output without the need for authentication,\" Ivanti  in an advisory.\n\n\"This can then allow the attacker control over machines running the EPM agent. When the core server is configured to use SQL express, this might lead to RCE on the core server.\"\nThe disclosure arrived weeks after the company  nearly two dozen security flaws in its Avalanche enterprise mobile device management (MDM) solution.\nOf the 21 issues, 13 are rated critical (CVSS scores: 9.8) and have been characterized as unauthenticated buffer overflows. They have been patched in Avalanche 6.4.2.\n\"An attacker sending specially crafted data packets to the Mobile Device Server can cause memory corruption which could result in a denial-of-service (DoS) or code execution,\" Ivanti .\n\nWhile there is no evidence that these aforementioned weaknesses have been exploited in the wild, state-backed actors have, in the past, exploited  (CVE-2023-35078 and CVE-2023-35081) in Ivanti Endpoint Manager Mobile (EPMM) to infiltrate the networks of multiple Norwegian government organizations.\nA month later,  in the Ivanti Sentry product (CVE-2023-38035, CVSS score: 9.8) came under active exploitation as a zero-day. \n\n\n\n",
    "ref": "https://thehackernews.com/2024/01/alert-ivanti-releases-patch-for.html",
    "titleTh": "การแจ้งเตือน: Ivanti เผยแพร่แพทช์สำหรับช่องโหว่ที่สำคัญในโซลูชัน Endpoint Manager",
    "contentTh": "Ivanti ได้เปิดตัวการอัปเดตความปลอดภัยเพื่อแก้ไขข้อบกพร่องร้ายแรงที่ส่งผลกระทบต่อโซลูชัน Endpoint Manager (EPM) ซึ่งหากช่องโหว่ประสบความสำเร็จ อาจส่งผลให้เกิดการเรียกใช้โค้ดจากระยะไกล (RCE) บนเซิร์ฟเวอร์ที่อ่อนแอ ติดตามเป็น CVE-2023-39336 ช่องโหว่นี้ได้รับการจัดอันดับ 9.6 จาก 10 ในระบบการให้คะแนน CVSS ข้อบกพร่องดังกล่าวจะส่งผลต่อ EPM 2021 และ EPM 2022 ก่อน SU5 “หากถูกโจมตี ผู้โจมตีที่สามารถเข้าถึงเครือข่ายภายในสามารถใช้ประโยชน์จากการฉีด SQL ที่ไม่ระบุเพื่อดำเนินการสืบค้น SQL โดยพลการ และดึงข้อมูลเอาต์พุตโดยไม่จำเป็นต้องตรวจสอบสิทธิ์” Ivanti กล่าวในที่ปรึกษา “สิ่งนี้สามารถอนุญาตให้ผู้โจมตีควบคุมเครื่องที่ใช้เอเจนต์ EPM ได้ เมื่อเซิร์ฟเวอร์หลักได้รับการกำหนดค่าให้ใช้ SQL express สิ่งนี้อาจนำไปสู่ RCE บนเซิร์ฟเวอร์หลัก” การเปิดเผยดังกล่าวเกิดขึ้นหลายสัปดาห์หลังจากที่บริษัทพบข้อบกพร่องด้านความปลอดภัยเกือบสองโหลในโซลูชันการจัดการอุปกรณ์มือถือระดับองค์กร (MDM) ของ Avalanche จาก 21 ประเด็น มี 13 ประเด็นที่ได้รับการจัดอันดับวิกฤต (คะแนน CVSS: 9.8) และถูกกำหนดให้เป็นบัฟเฟอร์ล้นที่ไม่ได้รับการรับรองความถูกต้อง พวกเขาได้รับการแก้ไขใน Avalanche 6.4.2 แล้ว “ผู้โจมตีที่ส่งแพ็กเก็ตข้อมูลที่จัดทำขึ้นเป็นพิเศษไปยังเซิร์ฟเวอร์อุปกรณ์มือถืออาจทำให้เกิดความเสียหายของหน่วยความจำซึ่งอาจส่งผลให้เกิดการปฏิเสธการให้บริการ (DoS) หรือการเรียกใช้โค้ด” Ivanti แม้ว่าจะไม่มีหลักฐานว่าจุดอ่อนดังกล่าวถูกนำไปใช้ประโยชน์ในป่า แต่ในอดีตผู้แสดงที่ได้รับการสนับสนุนจากรัฐก็เคยถูกเอาเปรียบ (CVE-2023-35078 และ CVE-2023-35081) ใน Ivanti Endpoint Manager Mobile (EPMM) เพื่อแทรกซึม เครือข่ายขององค์กรรัฐบาลนอร์เวย์หลายแห่ง หนึ่งเดือนต่อมา ในผลิตภัณฑ์ Ivanti Sentry (CVE-2023-38035, คะแนน CVSS: 9.8) ตกอยู่ภายใต้การเอารัดเอาเปรียบอย่างแข็งขันเป็นศูนย์วัน"
  },
  {
    "id": "_w5hdcxt87",
    "title": "Russian Hackers Had Covert Access to Ukraine's Telecom Giant for Months",
    "date": "Jan 05, 2024",
    "author": "Newsroom",
    "pTags": "Cyber Attack / Data Breach",
    "imgLinks": [
      "telecom.jpg"
    ],
    "contentEn": "\nUkrainian cybersecurity authorities have disclosed that the Russian state-sponsored threat actor known as  was inside telecom operator Kyivstar's systems at least since May 2023.\nThe development was  by Reuters.\nThe , described as a \"powerful hacker attack,\" first came to light last month, knocking out access to mobile and internet services for millions of customers. Soon after the incident, a Russia-linked hacking group called Solntsepyok took responsibility for the breach.\nSolntsepyok has been assessed to be a Russian threat group with affiliations to the Main Directorate of the General Staff of the Armed Forces of the Russian Federation (GRU), which also operates Sandworm.\n\nThe advanced persistent threat (APT) actor has a track record of orchestrating , with Denmark  the hacking outfit of targeting 22 energy sector companies last year.\nIllia Vitiuk, head of the Security Service of Ukraine's (SBU) cybersecurity department, said the attack against Kyivstar wiped out nearly everything from thousands of virtual servers and computers.\nThe incident, he said, \"completely destroyed the core of a telecoms operator,\" noting the attackers had full access likely at least since November, months after obtaining an initial foothold into the company's infrastructure.\n\"The attack had been carefully prepared during many months,\" Vitiuk  in a statement shared on the SBU's website.\nKyivstar, which has since , said there is no evidence that the personal data of subscribers has been compromised. It's currently not known how the threat actor penetrated its network.\n\nIt's worth noting that the company had  speculations about the attackers destroying its computers and servers as \"fake.\"\nThe development comes as the SBU  earlier this week that it took down two online surveillance cameras that were allegedly hacked by Russian intelligence agencies to spy on the defense forces and critical infrastructure in the capital city of Kyiv.\nThe agency said the compromise allowed the adversary to gain remote control of the cameras, adjust their viewing angles, and connect them to YouTube to capture \"all visual information in the range of the camera.\"\n\n\n\n",
    "ref": "https://thehackernews.com/2024/01/russian-hackers-had-covert-access-to.html",
    "titleTh": "แฮกเกอร์ชาวรัสเซียแอบเข้าถึงยักษ์ใหญ่โทรคมนาคมของยูเครนเป็นเวลาหลายเดือน",
    "contentTh": "เจ้าหน้าที่รักษาความปลอดภัยทางไซเบอร์ของยูเครนเปิดเผยว่าผู้คุกคามที่ได้รับการสนับสนุนจากรัฐรัสเซียซึ่งเป็นที่รู้จักในชื่อนั้นอยู่ในระบบของผู้ให้บริการโทรคมนาคม Kyivstar อย่างน้อยตั้งแต่เดือนพฤษภาคม 2023 การพัฒนาดำเนินการโดยสำนักข่าวรอยเตอร์ การโจมตีของแฮ็กเกอร์ซึ่งอธิบายว่าเป็น &quot;การโจมตีของแฮ็กเกอร์ที่ทรงพลัง&quot; เกิดขึ้นครั้งแรกเมื่อเดือนที่แล้ว ทำให้ลูกค้าหลายล้านคนไม่สามารถเข้าถึงบริการมือถือและอินเทอร์เน็ตได้ ไม่นานหลังจากเหตุการณ์ดังกล่าว กลุ่มแฮ็กเกอร์ที่เชื่อมโยงกับรัสเซียชื่อ Solntsepyok ก็รับผิดชอบต่อการละเมิดดังกล่าว Solntsepyok ได้รับการประเมินว่าเป็นกลุ่มภัยคุกคามของรัสเซียที่มีความเกี่ยวข้องกับ Main Directorate of the General Staff of the Armed Forces of the Armed Forces of the Russian Federation (GRU) ซึ่งปฏิบัติการ Sandworm ด้วย ผู้แสดงภัยคุกคามขั้นสูงแบบถาวร (APT) มีประวัติในการจัดการ โดยเดนมาร์กเป็นกลุ่มแฮ็กที่กำหนดเป้าหมายบริษัทในภาคพลังงาน 22 แห่งเมื่อปีที่แล้ว Illia Vitiuk หัวหน้าฝ่ายบริการรักษาความปลอดภัยของแผนกความปลอดภัยทางไซเบอร์ของยูเครน (SBU) กล่าวว่าการโจมตี Kyivstar ได้กวาดล้างเกือบทุกอย่างจากเซิร์ฟเวอร์เสมือนและคอมพิวเตอร์หลายพันเครื่อง เขากล่าวว่าเหตุการณ์ดังกล่าว “ทำลายแกนหลักของผู้ให้บริการโทรคมนาคมโดยสิ้นเชิง” โดยสังเกตว่าผู้โจมตีสามารถเข้าถึงได้อย่างเต็มที่อย่างน้อยตั้งแต่เดือนพฤศจิกายน ไม่กี่เดือนหลังจากได้รับการตั้งหลักเบื้องต้นในโครงสร้างพื้นฐานของบริษัท “การโจมตีได้รับการเตรียมการอย่างระมัดระวังในช่วงหลายเดือนมานี้” วิทิอุก ระบุในถ้อยแถลงที่แชร์บนเว็บไซต์ของ SBU Kyivstar ซึ่งนับตั้งแต่นั้นเป็นต้นมา กล่าวว่าไม่มีหลักฐานว่าข้อมูลส่วนบุคคลของสมาชิกถูกบุกรุก ขณะนี้ยังไม่ทราบว่าผู้คุกคามเจาะเครือข่ายของตนได้อย่างไร เป็นที่น่าสังเกตว่าบริษัทมีการคาดเดาเกี่ยวกับผู้โจมตีที่ทำลายคอมพิวเตอร์และเซิร์ฟเวอร์ของตนว่าเป็น &quot;ของปลอม&quot; การพัฒนาดังกล่าวเกิดขึ้นในขณะที่ SBU เมื่อต้นสัปดาห์นี้ว่าได้รื้อกล้องวงจรปิดออนไลน์ 2 ตัวที่ถูกกล่าวหาว่าแฮ็กโดยหน่วยข่าวกรองรัสเซียเพื่อสอดแนมกองกำลังป้องกันและโครงสร้างพื้นฐานที่สำคัญในเมืองหลวงของเคียฟ หน่วยงานดังกล่าวกล่าวว่าการประนีประนอมทำให้ฝ่ายตรงข้ามสามารถควบคุมกล้องจากระยะไกล ปรับมุมมอง และเชื่อมต่อกับ YouTube เพื่อบันทึก &quot;ข้อมูลภาพทั้งหมดที่อยู่ในระยะของกล้อง&quot;"
  },
  {
    "id": "_08sga843p",
    "title": "New Bandook RAT Variant Resurfaces, Targeting Windows Machines",
    "date": "Jan 05, 2024",
    "author": "Newsroom",
    "pTags": "Malware / Cyber Espionage",
    "imgLinks": [
      "windows.jpg"
    ],
    "contentEn": "\nA new variant of remote access trojan called Bandook has been observed being propagated via phishing attacks with an aim to infiltrate Windows machines, underscoring the continuous evolution of the malware.\nFortinet FortiGuard Labs, which identified the activity in October 2023, said the malware is distributed via a PDF file that embeds a link to a password-protected .7z archive.\n\"After the victim extracts the malware with the password in the PDF file, the malware injects its payload into msinfo32.exe,\" security researcher Pei Han Liao .\nBandook, first detected in 2007, is an  that comes with a wide range of features to remotely gain control of the infected systems.\n\nIn July 2021, Slovak cybersecurity firm ESET  a cyber espionage campaign that leveraged an upgraded variant of Bandook to breach corporate networks in Spanish-speaking countries such as Venezuela.\n\nThe starting point of the latest attack sequence is an injector component that's designed to decrypt and load the payload into , a legitimate Windows binary that gathers system information to diagnose computer issues.\nThe malware, besides making Windows Registry changes to establish persistence on the compromised host, establishes contact with a command-and-control (C2) server to retrieve additional payloads and instructions.\n\"These actions can be roughly categorized as file manipulation, registry manipulation, download, information stealing, file execution, invocation of functions in DLLs from the C2, controlling the victim's computer, process killing, and uninstalling the malware,\" Han Liao said. \n\n\n\n",
    "ref": "https://thehackernews.com/2024/01/new-bandook-rat-variant-resurfaces.html",
    "titleTh": "Bandook RAT Variant ใหม่กลับมาอีกครั้ง โดยมุ่งเป้าไปที่เครื่อง Windows",
    "contentTh": "โทรจันการเข้าถึงระยะไกลรูปแบบใหม่ที่เรียกว่า Bandook ได้รับการสังเกตว่าแพร่กระจายผ่านการโจมตีแบบฟิชชิ่งโดยมีจุดประสงค์เพื่อแทรกซึมเข้าไปในเครื่อง Windows ซึ่งเน้นย้ำถึงการพัฒนาอย่างต่อเนื่องของมัลแวร์ Fortinet FortiGuard Labs ซึ่งระบุกิจกรรมในเดือนตุลาคม 2566 กล่าวว่ามัลแวร์ถูกเผยแพร่ผ่านไฟล์ PDF ที่ฝังลิงก์ไปยังไฟล์เก็บถาวร .7z ที่ป้องกันด้วยรหัสผ่าน “หลังจากที่เหยื่อแยกมัลแวร์ด้วยรหัสผ่านในไฟล์ PDF มัลแวร์จะแทรกเพย์โหลดของมันลงใน msinfo32.exe” นักวิจัยด้านความปลอดภัย Pei Han Liao Bandook ซึ่งตรวจพบครั้งแรกในปี 2550 เป็นซอฟต์แวร์ที่มาพร้อมกับคุณสมบัติที่หลากหลายในการควบคุมระบบที่ติดไวรัสจากระยะไกล ในเดือนกรกฎาคม 2021 บริษัทรักษาความปลอดภัยทางไซเบอร์ของสโลวาเกีย ESET แคมเปญจารกรรมทางไซเบอร์ที่ใช้ประโยชน์จาก Bandook รุ่นอัพเกรดเพื่อเจาะเครือข่ายองค์กรในประเทศที่พูดภาษาสเปน เช่น เวเนซุเอลา จุดเริ่มต้นของลำดับการโจมตีล่าสุดคือส่วนประกอบหัวฉีดที่ออกแบบมาเพื่อถอดรหัสและโหลดเพย์โหลดลงใน ซึ่งเป็นไบนารี Windows ที่ถูกต้องตามกฎหมายที่รวบรวมข้อมูลระบบเพื่อวินิจฉัยปัญหาคอมพิวเตอร์ มัลแวร์นอกเหนือจากการเปลี่ยนแปลงรีจิสทรีของ Windows เพื่อสร้างการคงอยู่บนโฮสต์ที่ถูกบุกรุกแล้ว ยังสร้างการติดต่อกับเซิร์ฟเวอร์คำสั่งและการควบคุม (C2) เพื่อดึงข้อมูลเพย์โหลดและคำแนะนำเพิ่มเติม “การกระทำเหล่านี้สามารถแบ่งคร่าวๆ ได้เป็นการจัดการไฟล์ การจัดการรีจิสทรี การดาวน์โหลด การขโมยข้อมูล การเรียกใช้ไฟล์ การเรียกใช้ฟังก์ชันใน DLL จาก C2 การควบคุมคอมพิวเตอร์ของเหยื่อ การฆ่ากระบวนการ และการถอนการติดตั้งมัลแวร์” Han Liao กล่าว"
  },
  {
    "id": "_29sa8vjm5",
    "title": "Alert: Ivanti Releases Patch for Critical Vulnerability in Endpoint Manager Solution",
    "date": "Jan 05, 2024",
    "author": "Newsroom",
    "pTags": "Vulnerability / Network Security",
    "imgLinks": [
      "ivanti.jpg"
    ],
    "contentEn": "\nIvanti has released security updates to address a critical flaw impacting its Endpoint Manager (EPM) solution that, if successfully exploited, could result in remote code execution (RCE) on susceptible servers.\nTracked as CVE-2023-39336, the vulnerability has been rated 9.6 out of 10 on the CVSS scoring system. The shortcoming impacts EPM 2021 and EPM 2022 prior to SU5.\n\"If exploited, an attacker with access to the internal network can leverage an unspecified SQL injection to execute arbitrary SQL queries and retrieve output without the need for authentication,\" Ivanti  in an advisory.\n\n\"This can then allow the attacker control over machines running the EPM agent. When the core server is configured to use SQL express, this might lead to RCE on the core server.\"\nThe disclosure arrived weeks after the company  nearly two dozen security flaws in its Avalanche enterprise mobile device management (MDM) solution.\nOf the 21 issues, 13 are rated critical (CVSS scores: 9.8) and have been characterized as unauthenticated buffer overflows. They have been patched in Avalanche 6.4.2.\n\"An attacker sending specially crafted data packets to the Mobile Device Server can cause memory corruption which could result in a denial-of-service (DoS) or code execution,\" Ivanti .\n\nWhile there is no evidence that these aforementioned weaknesses have been exploited in the wild, state-backed actors have, in the past, exploited  (CVE-2023-35078 and CVE-2023-35081) in Ivanti Endpoint Manager Mobile (EPMM) to infiltrate the networks of multiple Norwegian government organizations.\nA month later,  in the Ivanti Sentry product (CVE-2023-38035, CVSS score: 9.8) came under active exploitation as a zero-day. \n\n\n\n",
    "ref": "https://thehackernews.com/2024/01/alert-ivanti-releases-patch-for.html",
    "titleTh": "การแจ้งเตือน: Ivanti เผยแพร่แพทช์สำหรับช่องโหว่ที่สำคัญในโซลูชัน Endpoint Manager",
    "contentTh": "Ivanti ได้เปิดตัวการอัปเดตความปลอดภัยเพื่อแก้ไขข้อบกพร่องร้ายแรงที่ส่งผลกระทบต่อโซลูชัน Endpoint Manager (EPM) ซึ่งหากช่องโหว่ประสบความสำเร็จ อาจส่งผลให้เกิดการเรียกใช้โค้ดจากระยะไกล (RCE) บนเซิร์ฟเวอร์ที่อ่อนแอ ติดตามเป็น CVE-2023-39336 ช่องโหว่นี้ได้รับการจัดอันดับ 9.6 จาก 10 ในระบบการให้คะแนน CVSS ข้อบกพร่องดังกล่าวจะส่งผลต่อ EPM 2021 และ EPM 2022 ก่อน SU5 “หากถูกโจมตี ผู้โจมตีที่สามารถเข้าถึงเครือข่ายภายในสามารถใช้ประโยชน์จากการฉีด SQL ที่ไม่ระบุเพื่อดำเนินการสืบค้น SQL โดยพลการ และดึงข้อมูลเอาต์พุตโดยไม่จำเป็นต้องตรวจสอบสิทธิ์” Ivanti กล่าวในที่ปรึกษา “สิ่งนี้สามารถอนุญาตให้ผู้โจมตีควบคุมเครื่องที่ใช้เอเจนต์ EPM ได้ เมื่อเซิร์ฟเวอร์หลักได้รับการกำหนดค่าให้ใช้ SQL express สิ่งนี้อาจนำไปสู่ RCE บนเซิร์ฟเวอร์หลัก” การเปิดเผยดังกล่าวเกิดขึ้นหลายสัปดาห์หลังจากที่บริษัทพบข้อบกพร่องด้านความปลอดภัยเกือบสองโหลในโซลูชันการจัดการอุปกรณ์มือถือระดับองค์กร (MDM) ของ Avalanche จาก 21 ประเด็น มี 13 ประเด็นที่ได้รับการจัดอันดับวิกฤต (คะแนน CVSS: 9.8) และถูกกำหนดให้เป็นบัฟเฟอร์ล้นที่ไม่ได้รับการรับรองความถูกต้อง พวกเขาได้รับการแก้ไขใน Avalanche 6.4.2 แล้ว “ผู้โจมตีที่ส่งแพ็กเก็ตข้อมูลที่จัดทำขึ้นเป็นพิเศษไปยังเซิร์ฟเวอร์อุปกรณ์มือถืออาจทำให้เกิดความเสียหายของหน่วยความจำซึ่งอาจส่งผลให้เกิดการปฏิเสธการให้บริการ (DoS) หรือการเรียกใช้โค้ด” Ivanti แม้ว่าจะไม่มีหลักฐานว่าจุดอ่อนดังกล่าวถูกนำไปใช้ประโยชน์ในป่า แต่ในอดีตผู้แสดงที่ได้รับการสนับสนุนจากรัฐก็เคยถูกเอาเปรียบ (CVE-2023-35078 และ CVE-2023-35081) ใน Ivanti Endpoint Manager Mobile (EPMM) เพื่อแทรกซึม เครือข่ายขององค์กรรัฐบาลนอร์เวย์หลายแห่ง หนึ่งเดือนต่อมา ในผลิตภัณฑ์ Ivanti Sentry (CVE-2023-38035, คะแนน CVSS: 9.8) ตกอยู่ภายใต้การเอารัดเอาเปรียบอย่างแข็งขันเป็นศูนย์วัน"
  },
  {
    "id": "_lrkqtg2ep",
    "title": "Russian Hackers Had Covert Access to Ukraine's Telecom Giant for Months",
    "date": "Jan 05, 2024",
    "author": "Newsroom",
    "pTags": "Cyber Attack / Data Breach",
    "imgLinks": [
      "telecom.jpg"
    ],
    "contentEn": "\nUkrainian cybersecurity authorities have disclosed that the Russian state-sponsored threat actor known as  was inside telecom operator Kyivstar's systems at least since May 2023.\nThe development was  by Reuters.\nThe , described as a \"powerful hacker attack,\" first came to light last month, knocking out access to mobile and internet services for millions of customers. Soon after the incident, a Russia-linked hacking group called Solntsepyok took responsibility for the breach.\nSolntsepyok has been assessed to be a Russian threat group with affiliations to the Main Directorate of the General Staff of the Armed Forces of the Russian Federation (GRU), which also operates Sandworm.\n\nThe advanced persistent threat (APT) actor has a track record of orchestrating , with Denmark  the hacking outfit of targeting 22 energy sector companies last year.\nIllia Vitiuk, head of the Security Service of Ukraine's (SBU) cybersecurity department, said the attack against Kyivstar wiped out nearly everything from thousands of virtual servers and computers.\nThe incident, he said, \"completely destroyed the core of a telecoms operator,\" noting the attackers had full access likely at least since November, months after obtaining an initial foothold into the company's infrastructure.\n\"The attack had been carefully prepared during many months,\" Vitiuk  in a statement shared on the SBU's website.\nKyivstar, which has since , said there is no evidence that the personal data of subscribers has been compromised. It's currently not known how the threat actor penetrated its network.\n\nIt's worth noting that the company had  speculations about the attackers destroying its computers and servers as \"fake.\"\nThe development comes as the SBU  earlier this week that it took down two online surveillance cameras that were allegedly hacked by Russian intelligence agencies to spy on the defense forces and critical infrastructure in the capital city of Kyiv.\nThe agency said the compromise allowed the adversary to gain remote control of the cameras, adjust their viewing angles, and connect them to YouTube to capture \"all visual information in the range of the camera.\"\n\n\n\n",
    "ref": "https://thehackernews.com/2024/01/russian-hackers-had-covert-access-to.html",
    "titleTh": "แฮกเกอร์ชาวรัสเซียแอบเข้าถึงยักษ์ใหญ่โทรคมนาคมของยูเครนเป็นเวลาหลายเดือน",
    "contentTh": "เจ้าหน้าที่รักษาความปลอดภัยทางไซเบอร์ของยูเครนเปิดเผยว่าผู้คุกคามที่ได้รับการสนับสนุนจากรัฐรัสเซียซึ่งเป็นที่รู้จักในชื่อนั้นอยู่ในระบบของผู้ให้บริการโทรคมนาคม Kyivstar อย่างน้อยตั้งแต่เดือนพฤษภาคม 2023 การพัฒนาดำเนินการโดยสำนักข่าวรอยเตอร์ การโจมตีของแฮ็กเกอร์ซึ่งอธิบายว่าเป็น &quot;การโจมตีของแฮ็กเกอร์ที่ทรงพลัง&quot; เกิดขึ้นครั้งแรกเมื่อเดือนที่แล้ว ทำให้ลูกค้าหลายล้านคนไม่สามารถเข้าถึงบริการมือถือและอินเทอร์เน็ตได้ ไม่นานหลังจากเหตุการณ์ดังกล่าว กลุ่มแฮ็กเกอร์ที่เชื่อมโยงกับรัสเซียชื่อ Solntsepyok ก็รับผิดชอบต่อการละเมิดดังกล่าว Solntsepyok ได้รับการประเมินว่าเป็นกลุ่มภัยคุกคามของรัสเซียที่มีความเกี่ยวข้องกับ Main Directorate of the General Staff of the Armed Forces of the Armed Forces of the Russian Federation (GRU) ซึ่งปฏิบัติการ Sandworm ด้วย ผู้แสดงภัยคุกคามขั้นสูงแบบถาวร (APT) มีประวัติในการจัดการ โดยเดนมาร์กเป็นกลุ่มแฮ็กที่กำหนดเป้าหมายบริษัทในภาคพลังงาน 22 แห่งเมื่อปีที่แล้ว Illia Vitiuk หัวหน้าฝ่ายบริการรักษาความปลอดภัยของแผนกความปลอดภัยทางไซเบอร์ของยูเครน (SBU) กล่าวว่าการโจมตี Kyivstar ได้กวาดล้างเกือบทุกอย่างจากเซิร์ฟเวอร์เสมือนและคอมพิวเตอร์หลายพันเครื่อง เขากล่าวว่าเหตุการณ์ดังกล่าว “ทำลายแกนหลักของผู้ให้บริการโทรคมนาคมโดยสิ้นเชิง” โดยสังเกตว่าผู้โจมตีสามารถเข้าถึงได้อย่างเต็มที่อย่างน้อยตั้งแต่เดือนพฤศจิกายน ไม่กี่เดือนหลังจากได้รับการตั้งหลักเบื้องต้นในโครงสร้างพื้นฐานของบริษัท “การโจมตีได้รับการเตรียมการอย่างระมัดระวังในช่วงหลายเดือนมานี้” วิทิอุก ระบุในถ้อยแถลงที่แชร์บนเว็บไซต์ของ SBU Kyivstar ซึ่งนับตั้งแต่นั้นเป็นต้นมา กล่าวว่าไม่มีหลักฐานว่าข้อมูลส่วนบุคคลของสมาชิกถูกบุกรุก ขณะนี้ยังไม่ทราบว่าผู้คุกคามเจาะเครือข่ายของตนได้อย่างไร เป็นที่น่าสังเกตว่าบริษัทมีการคาดเดาเกี่ยวกับผู้โจมตีที่ทำลายคอมพิวเตอร์และเซิร์ฟเวอร์ของตนว่าเป็น &quot;ของปลอม&quot; การพัฒนาดังกล่าวเกิดขึ้นในขณะที่ SBU เมื่อต้นสัปดาห์นี้ว่าได้รื้อกล้องวงจรปิดออนไลน์ 2 ตัวที่ถูกกล่าวหาว่าแฮ็กโดยหน่วยข่าวกรองรัสเซียเพื่อสอดแนมกองกำลังป้องกันและโครงสร้างพื้นฐานที่สำคัญในเมืองหลวงของเคียฟ หน่วยงานดังกล่าวกล่าวว่าการประนีประนอมทำให้ฝ่ายตรงข้ามสามารถควบคุมกล้องจากระยะไกล ปรับมุมมอง และเชื่อมต่อกับ YouTube เพื่อบันทึก &quot;ข้อมูลภาพทั้งหมดที่อยู่ในระยะของกล้อง&quot;"
  },
  {
    "id": "_ssvbodtoh",
    "title": "New Bandook RAT Variant Resurfaces, Targeting Windows Machines",
    "date": "Jan 05, 2024",
    "author": "Newsroom",
    "pTags": "Malware / Cyber Espionage",
    "imgLinks": [
      "windows.jpg"
    ],
    "contentEn": "\nA new variant of remote access trojan called Bandook has been observed being propagated via phishing attacks with an aim to infiltrate Windows machines, underscoring the continuous evolution of the malware.\nFortinet FortiGuard Labs, which identified the activity in October 2023, said the malware is distributed via a PDF file that embeds a link to a password-protected .7z archive.\n\"After the victim extracts the malware with the password in the PDF file, the malware injects its payload into msinfo32.exe,\" security researcher Pei Han Liao .\nBandook, first detected in 2007, is an  that comes with a wide range of features to remotely gain control of the infected systems.\n\nIn July 2021, Slovak cybersecurity firm ESET  a cyber espionage campaign that leveraged an upgraded variant of Bandook to breach corporate networks in Spanish-speaking countries such as Venezuela.\n\nThe starting point of the latest attack sequence is an injector component that's designed to decrypt and load the payload into , a legitimate Windows binary that gathers system information to diagnose computer issues.\nThe malware, besides making Windows Registry changes to establish persistence on the compromised host, establishes contact with a command-and-control (C2) server to retrieve additional payloads and instructions.\n\"These actions can be roughly categorized as file manipulation, registry manipulation, download, information stealing, file execution, invocation of functions in DLLs from the C2, controlling the victim's computer, process killing, and uninstalling the malware,\" Han Liao said. \n\n\n\n",
    "ref": "https://thehackernews.com/2024/01/new-bandook-rat-variant-resurfaces.html",
    "titleTh": "Bandook RAT Variant ใหม่กลับมาอีกครั้ง โดยมุ่งเป้าไปที่เครื่อง Windows",
    "contentTh": "โทรจันการเข้าถึงระยะไกลรูปแบบใหม่ที่เรียกว่า Bandook ได้รับการสังเกตว่าแพร่กระจายผ่านการโจมตีแบบฟิชชิ่งโดยมีจุดประสงค์เพื่อแทรกซึมเข้าไปในเครื่อง Windows ซึ่งเน้นย้ำถึงการพัฒนาอย่างต่อเนื่องของมัลแวร์ Fortinet FortiGuard Labs ซึ่งระบุกิจกรรมในเดือนตุลาคม 2566 กล่าวว่ามัลแวร์ถูกเผยแพร่ผ่านไฟล์ PDF ที่ฝังลิงก์ไปยังไฟล์เก็บถาวร .7z ที่ป้องกันด้วยรหัสผ่าน “หลังจากที่เหยื่อแยกมัลแวร์ด้วยรหัสผ่านในไฟล์ PDF มัลแวร์จะแทรกเพย์โหลดของมันลงใน msinfo32.exe” นักวิจัยด้านความปลอดภัย Pei Han Liao Bandook ซึ่งตรวจพบครั้งแรกในปี 2550 เป็นซอฟต์แวร์ที่มาพร้อมกับคุณสมบัติที่หลากหลายในการควบคุมระบบที่ติดไวรัสจากระยะไกล ในเดือนกรกฎาคม 2021 บริษัทรักษาความปลอดภัยทางไซเบอร์ของสโลวาเกีย ESET แคมเปญจารกรรมทางไซเบอร์ที่ใช้ประโยชน์จาก Bandook รุ่นอัพเกรดเพื่อเจาะเครือข่ายองค์กรในประเทศที่พูดภาษาสเปน เช่น เวเนซุเอลา จุดเริ่มต้นของลำดับการโจมตีล่าสุดคือส่วนประกอบหัวฉีดที่ออกแบบมาเพื่อถอดรหัสและโหลดเพย์โหลดลงใน ซึ่งเป็นไบนารี Windows ที่ถูกต้องตามกฎหมายที่รวบรวมข้อมูลระบบเพื่อวินิจฉัยปัญหาคอมพิวเตอร์ มัลแวร์นอกเหนือจากการเปลี่ยนแปลงรีจิสทรีของ Windows เพื่อสร้างการคงอยู่บนโฮสต์ที่ถูกบุกรุกแล้ว ยังสร้างการติดต่อกับเซิร์ฟเวอร์คำสั่งและการควบคุม (C2) เพื่อดึงข้อมูลเพย์โหลดและคำแนะนำเพิ่มเติม “การกระทำเหล่านี้สามารถแบ่งคร่าวๆ ได้เป็นการจัดการไฟล์ การจัดการรีจิสทรี การดาวน์โหลด การขโมยข้อมูล การเรียกใช้ไฟล์ การเรียกใช้ฟังก์ชันใน DLL จาก C2 การควบคุมคอมพิวเตอร์ของเหยื่อ การฆ่ากระบวนการ และการถอนการติดตั้งมัลแวร์” Han Liao กล่าว"
  }
]