[
  {
    "id": "_zg15pnav4",
    "category": "Home",
    "title": "Exposed Secrets are Everywhere. Here's How to Tackle Them",
    "date": "Jan 05, 2024",
    "author": "The Hacker News",
    "pTags": "Threat Intelligence / Security Automation",
    "imgLinks": [
      "entro.jpg"
    ],
    "contentEn": "\nPicture this: you stumble upon a concealed secret within your company's source code. Instantly, a wave of panic hits as you grasp the possible consequences. This one hidden secret has the power to pave the way for unauthorized entry, data breaches, and a damaged reputation. Understanding the secret is just the beginning; swift and resolute action becomes imperative. However, lacking the necessary context, you're left pondering the optimal steps to take. What's the right path forward in this situation?\nSecrets management is an essential aspect of any organization's security strategy. In a world where breaches are increasingly common, managing sensitive information such as API keys, credentials, and tokens can make all the difference. Secret scanners play a role in identifying exposed secrets within source code, but they have one significant limitation: they don't provide context. And without context, it's impossible to devise an appropriate response plan.\nContext and Response: Key factors in addressing exposed secrets#\nWhen it comes to addressing exposed secrets, context is everything as you are the . Without it, you don't know the severity of the exposure, the potential impact, and the best course of action.\nHere are some key factors to consider when contextualizing exposed secrets:\n1 — Classify secrets based on sensitivity and importance#\nNot all secrets are created equal. Some are more critical to your organization's security than others. Classifying your secrets based on their sensitivity and importance will help you prioritize which ones need immediate attention and remediation.\n2 — Understand the scope of exposure and potential impact#\nOnce you've classified the exposed secret, it's crucial to assess the scope of the exposure. Has the secret been leaked to a public repository/darknet, or is it still in your internal systems? Understanding the extent of the exposure will help you determine the potential impact and risk on your organization and help create your response plan.\n3 — Identify the root cause of the exposure#\nGetting to the exposure's root cause is essential for an exposed secrets remediation process, and to prevent future attacks. By identifying how the secret was exposed, you can take steps to address the underlying issue- preventing similar incidents from occurring in the future. This could involve updating security policies, improving code review processes, or implementing additional access controls.\n4 — Secrets enrichment#\nSecrets, while seemingly meaningless strings of characters, carry significant metadata. This includes ownership details, creation, rotation timestamps, assigned privileges for cloud service access, associated risks, and much more. Entro uses this wealth of information to construct a dynamic threat model or a secret lineage map that illustrates the connections between applications or compute workloads, the secrets they employ, and the cloud services they access — thus providing a comprehensive view of each secret's security and compliance status.\nRemediation and Prevention: Securing your organization's Secrets#\nAddressing exposed secrets requires a process of remediation and prevention. Here's how you can secure your organization's secrets effectively:\n1 — Mitigate the impact of exposed secrets:#\nTake swift action to mitigate the potential harm stemming from the revealed secret. This could entail changing or invalidating the compromised secret, reaching out to impacted parties, and vigilantly observing for any unusual or suspicious behavior due to the disclosure. In certain cases, it might be necessary to engage law enforcement or seek assistance from external security experts.\n2 — Implement policies and processes to prevent future exposures:#\nLearn from the exposure and take steps to prevent similar incidents. This might include crafting or revising your company's security protocols, adopting secure development methodologies, and educating staff on effectively managing confidential data. It's also crucial to regularly audit your secrets management processes to ensure compliance and effectiveness.\n3 — Regular monitoring and auditing of secrets:#\nMonitoring your organization's secrets is vital in identifying potential exposures and mitigating risks. Implementing automated tools and processes to monitor and audit secrets will help you keep track of sensitive information, detect anomalies, and trigger alerts for any unauthorized access or changes.\nLeveraging technology for effective secrets management#\nAs your organization grows, managing secrets manually becomes increasingly complex and error-prone. Leveraging technology can significantly enhance your secrets management strategy.\n1 — Embrace automation: #\nAutomation can help streamline the process of managing exposed secrets, providing you with faster detection, classification, and response capabilities. Look for tools that integrate with your existing security workflows, reducing the need for manual intervention. Through its auto-discovery process, Entro can identify the owner of each secret or token, automate resolution procedures, and detect misconfigurations in vaults and secrets stores, ensuring a faster response to security incidents.\n2 — Platforms that provide essential context: #\nSome advanced secrets management platforms go beyond simple scanning, offering valuable context that can help you respond more effectively to exposed secrets. Entro is one such platform, and very uniquely so since it goes above and beyond to create the most comprehensive secret lineage maps to provide valuable context, enabling a more effective response to exposed secrets.\n3 — Integration with existing tools: #\nEnsure your chosen technology can easily integrate with your existing security tools and workflows. Seamless integration will help you maintain a consistent security posture across your organization and maximize your current investments in security solutions.\nConclusion#\nEffectively handling exposed secrets is crucial for protecting your company's confidential data and maintaining trust among stakeholders. Recognizing the significance of context in dealing with revealed secrets empowers you to make informed choices regarding fixing and preventing issues. Integrating technology and a strong approach to managing secrets into your workflow enhances your organization's security posture, minimizing the chances of unauthorized entry and data breaches.\nAppreciating this pivotal aspect of cybersecurity, it becomes clear that it's not merely about awareness but also action. This is where solutions like Entro come into play. Specifically designed to tackle the challenges we've explored, Entro offers a comprehensive approach to secrets management that transcends basic scanning. It provides the crucial context needed for effective remediation and prevention. It creates a dynamic threat model map using this context, thus positioning your organization a step ahead in the face of security threats\nProtecting your organization's sensitive data is too critical to be left to chance. As such, it's time to harness the power of proactive and strategic management of exposed secrets. Check out our  to explore how Entro can empower you to strengthen your organization's security posture. \n to learn more about Entro and how it can benefit your organization. \n\nwindow.dataLayer = window.dataLayer || [];\nfunction gtag(){dataLayer.push(arguments);}\ngtag('js', new Date()); gtag('config', 'G-6BQMQDE452');\n\n\n\n\n",
    "ref": "https://thehackernews.com/2024/01/exposed-secrets-are-everywhere-heres.html",
    "titleTh": "ความลับที่ถูกเปิดเผยมีอยู่ทั่วไป ต่อไปนี้เป็นวิธีจัดการกับพวกเขา",
    "contentTh": "ลองนึกภาพ: คุณสะดุดกับความลับที่ซ่อนอยู่ภายในซอร์สโค้ดของบริษัทของคุณ คลื่นแห่งความตื่นตระหนกเกิดขึ้นทันทีเมื่อคุณเข้าใจถึงผลที่ตามมาที่อาจเกิดขึ้น ความลับที่ซ่อนอยู่นี้มีพลังในการปูทางไปสู่การเข้าถึงโดยไม่ได้รับอนุญาต การละเมิดข้อมูล และชื่อเสียงที่เสียหาย การทำความเข้าใจความลับเป็นเพียงจุดเริ่มต้นเท่านั้น การกระทำที่รวดเร็วและเด็ดเดี่ยวกลายเป็นสิ่งจำเป็น อย่างไรก็ตาม หากไม่มีบริบทที่จำเป็น คุณยังต้องไตร่ตรองถึงขั้นตอนที่เหมาะสมที่สุดที่จะดำเนินการ เส้นทางที่ถูกต้องในสถานการณ์นี้คืออะไร? การจัดการความลับเป็นส่วนสำคัญของกลยุทธ์การรักษาความปลอดภัยขององค์กร ในโลกที่การละเมิดเป็นเรื่องปกติมากขึ้น การจัดการข้อมูลที่ละเอียดอ่อน เช่น คีย์ API ข้อมูลประจำตัว และโทเค็น สามารถสร้างความแตกต่างได้ โปรแกรมสแกนความลับมีบทบาทในการระบุความลับที่ถูกเปิดเผยภายในซอร์สโค้ด แต่มีข้อจำกัดที่สำคัญประการหนึ่ง นั่นคือ ไม่มีบริบทให้ และหากไม่มีบริบท ก็เป็นไปไม่ได้ที่จะจัดทำแผนเผชิญเหตุที่เหมาะสม บริบทและการตอบสนอง: ปัจจัยสำคัญในการจัดการกับความลับที่ถูกเปิดเผย# เมื่อพูดถึงการจัดการกับความลับที่ถูกเปิดเผย บริบทก็คือทุกสิ่งทุกอย่างตามที่คุณเป็น หากไม่มีสิ่งนี้ คุณจะไม่ทราบถึงความรุนแรงของการสัมผัส ผลกระทบที่อาจเกิดขึ้น และแนวทางปฏิบัติที่ดีที่สุด ต่อไปนี้เป็นปัจจัยสำคัญบางประการที่ควรพิจารณาเมื่อกำหนดบริบทของความลับที่เปิดเผย: 1 — จำแนกความลับตามความละเอียดอ่อนและความสำคัญ# ความลับทั้งหมดไม่ได้ถูกสร้างขึ้นมาเท่ากัน บางอย่างมีความสำคัญต่อความปลอดภัยขององค์กรของคุณมากกว่าอย่างอื่น การจัดหมวดหมู่ความลับของคุณตามความอ่อนไหวและความสำคัญของมันจะช่วยให้คุณจัดลำดับความสำคัญว่าความลับไหนที่ต้องได้รับการดูแลและแก้ไขทันที 2 — ทำความเข้าใจขอบเขตของการสัมผัสและผลกระทบที่อาจเกิดขึ้น# เมื่อคุณจำแนกความลับที่ถูกเปิดเผยแล้ว การประเมินขอบเขตของการเปิดเผยก็เป็นสิ่งสำคัญ ข้อมูลลับรั่วไหลไปยังพื้นที่เก็บข้อมูลสาธารณะ/darknet หรือยังอยู่ในระบบภายในของคุณ? การทำความเข้าใจขอบเขตของความเสี่ยงจะช่วยให้คุณระบุผลกระทบและความเสี่ยงที่อาจเกิดขึ้นกับองค์กรของคุณ และช่วยสร้างแผนรับมือของคุณ 3 — ระบุสาเหตุที่แท้จริงของการสัมผัส# การเข้าถึงต้นตอของการเปิดเผยถือเป็นสิ่งสำคัญสำหรับกระบวนการแก้ไขความลับที่ถูกเปิดเผย และเพื่อป้องกันการโจมตีในอนาคต ด้วยการระบุว่าความลับถูกเปิดเผยอย่างไร คุณสามารถดำเนินการเพื่อแก้ไขปัญหาที่ซ่อนอยู่ ป้องกันไม่ให้เหตุการณ์ที่คล้ายกันเกิดขึ้นในอนาคต ซึ่งอาจเกี่ยวข้องกับการอัปเดตนโยบายความปลอดภัย การปรับปรุงกระบวนการตรวจสอบโค้ด หรือการใช้การควบคุมการเข้าถึงเพิ่มเติม 4 — การเพิ่มคุณค่าความลับ# ความลับ แม้ว่าสตริงอักขระที่ดูไม่มีความหมาย แต่ก็มีข้อมูลเมตาที่สำคัญอยู่ด้วย ซึ่งรวมถึงรายละเอียดการเป็นเจ้าของ การสร้าง การประทับเวลาการหมุนเวียน สิทธิ์ที่ได้รับมอบหมายสำหรับการเข้าถึงบริการคลาวด์ ความเสี่ยงที่เกี่ยวข้อง และอื่นๆ อีกมากมาย Entro ใช้ข้อมูลมากมายนี้เพื่อสร้างโมเดลภัยคุกคามแบบไดนามิกหรือแผนที่สืบเชื้อสายลับที่แสดงให้เห็นการเชื่อมต่อระหว่างแอปพลิเคชันหรือปริมาณงานประมวลผล ความลับที่พวกเขาใช้ และบริการคลาวด์ที่พวกเขาเข้าถึง ดังนั้นจึงให้มุมมองที่ครอบคลุมเกี่ยวกับความปลอดภัยและการปฏิบัติตามข้อกำหนดของความลับแต่ละรายการ สถานะ. การแก้ไขและการป้องกัน: การรักษาความลับขององค์กรของคุณ# การจัดการกับความลับที่ถูกเปิดเผยต้องใช้กระบวนการแก้ไขและป้องกัน ต่อไปนี้คือวิธีที่คุณสามารถรักษาความปลอดภัยความลับขององค์กรของคุณได้อย่างมีประสิทธิภาพ: 1 — ลดผลกระทบของความลับที่ถูกเปิดเผย:# ดำเนินการอย่างรวดเร็วเพื่อบรรเทาอันตรายที่อาจเกิดขึ้นจากความลับที่ถูกเปิดเผย ซึ่งอาจรวมถึงการเปลี่ยนแปลงหรือทำให้ความลับที่ถูกบุกรุกเป็นโมฆะ การติดต่อไปยังฝ่ายที่ได้รับผลกระทบ และการสังเกตพฤติกรรมที่ผิดปกติหรือน่าสงสัยอันเนื่องมาจากการเปิดเผยอย่างระมัดระวัง ในบางกรณี อาจจำเป็นต้องติดต่อกับหน่วยงานบังคับใช้กฎหมายหรือขอความช่วยเหลือจากผู้เชี่ยวชาญด้านความปลอดภัยภายนอก 2 — ดำเนินนโยบายและกระบวนการเพื่อป้องกันความเสี่ยงในอนาคต:# เรียนรู้จากการสัมผัสและดำเนินการเพื่อป้องกันเหตุการณ์ที่คล้ายกัน ซึ่งอาจรวมถึงการสร้างหรือแก้ไขโปรโตคอลความปลอดภัยของบริษัทของคุณ การใช้วิธีการพัฒนาที่ปลอดภัย และการให้ความรู้แก่พนักงานเกี่ยวกับการจัดการข้อมูลที่เป็นความลับอย่างมีประสิทธิภาพ การตรวจสอบกระบวนการจัดการความลับของคุณเป็นประจำเพื่อให้มั่นใจว่ามีการปฏิบัติตามกฎระเบียบและมีประสิทธิผลถือเป็นสิ่งสำคัญเช่นกัน 3 — การติดตามและตรวจสอบความลับเป็นประจำ:# การตรวจสอบความลับขององค์กรของคุณมีความสำคัญในการระบุความเสี่ยงที่อาจเกิดขึ้นและลดความเสี่ยง การใช้เครื่องมือและกระบวนการอัตโนมัติเพื่อตรวจสอบและตรวจสอบความลับจะช่วยให้คุณติดตามข้อมูลที่ละเอียดอ่อน ตรวจจับความผิดปกติ และเรียกใช้การแจ้งเตือนสำหรับการเข้าถึงหรือการเปลี่ยนแปลงที่ไม่ได้รับอนุญาต การใช้ประโยชน์จากเทคโนโลยีเพื่อการจัดการความลับที่มีประสิทธิภาพ# เมื่อองค์กรของคุณเติบโตขึ้น การจัดการความลับด้วยตนเองจะมีความซับซ้อนและเสี่ยงต่อข้อผิดพลาดมากขึ้น การใช้ประโยชน์จากเทคโนโลยีสามารถปรับปรุงกลยุทธ์การจัดการความลับของคุณได้อย่างมาก 1 — ยอมรับระบบอัตโนมัติ: # ระบบอัตโนมัติสามารถช่วยปรับปรุงกระบวนการจัดการความลับที่ถูกเปิดเผย ทำให้คุณตรวจพบ จำแนกประเภท และความสามารถในการตอบสนองได้เร็วขึ้น มองหาเครื่องมือที่ผสานรวมกับเวิร์กโฟลว์การรักษาความปลอดภัยที่มีอยู่ของคุณ ช่วยลดความจำเป็นในการแทรกแซงด้วยตนเอง ด้วยกระบวนการค้นพบอัตโนมัติ Entro สามารถระบุเจ้าของความลับหรือโทเค็นแต่ละรายการ ทำให้ขั้นตอนการแก้ปัญหาเป็นอัตโนมัติ และตรวจจับการกำหนดค่าที่ไม่ถูกต้องในห้องนิรภัยและร้านค้าลับ เพื่อให้มั่นใจว่าจะตอบสนองต่อเหตุการณ์ด้านความปลอดภัยได้เร็วขึ้น 2 — แพลตฟอร์มที่ให้บริบทที่สำคัญ: # แพลตฟอร์มการจัดการความลับขั้นสูงบางแพลตฟอร์มเป็นมากกว่าการสแกนแบบธรรมดา โดยนำเสนอบริบทอันมีคุณค่าที่สามารถช่วยให้คุณตอบสนองต่อความลับที่ถูกเปิดเผยได้อย่างมีประสิทธิภาพมากขึ้น Entro เป็นหนึ่งในแพลตฟอร์มดังกล่าว และมีเอกลักษณ์เฉพาะตัวมาก เนื่องจากเป็นแพลตฟอร์มที่ก้าวไปไกลกว่านั้นในการสร้างแผนที่เชื้อสายลับที่ครอบคลุมมากที่สุดเพื่อให้บริบทที่มีคุณค่า ช่วยให้สามารถตอบสนองต่อความลับที่ถูกเปิดเผยได้อย่างมีประสิทธิภาพมากขึ้น 3 — บูรณาการกับเครื่องมือที่มีอยู่: # ตรวจสอบให้แน่ใจว่าเทคโนโลยีที่คุณเลือกสามารถผสานรวมกับเครื่องมือรักษาความปลอดภัยและขั้นตอนการทำงานที่มีอยู่ของคุณได้อย่างง่ายดาย การบูรณาการที่ราบรื่นจะช่วยให้คุณรักษามาตรการรักษาความปลอดภัยที่สอดคล้องกันทั่วทั้งองค์กรของคุณ และเพิ่มการลงทุนในปัจจุบันในโซลูชันการรักษาความปลอดภัยให้เกิดประโยชน์สูงสุด บทสรุป# การจัดการความลับที่ถูกเปิดเผยอย่างมีประสิทธิภาพถือเป็นสิ่งสำคัญในการปกป้องข้อมูลที่เป็นความลับของบริษัทของคุณและการรักษาความไว้วางใจระหว่างผู้มีส่วนได้ส่วนเสีย การตระหนักถึงความสำคัญของบริบทในการจัดการกับความลับที่ถูกเปิดเผยช่วยให้คุณสามารถตัดสินใจได้อย่างรอบรู้เกี่ยวกับการแก้ไขและป้องกันปัญหา การบูรณาการเทคโนโลยีและแนวทางการจัดการความลับเข้ากับขั้นตอนการทำงานของคุณจะช่วยปรับปรุงมาตรการรักษาความปลอดภัยขององค์กรของคุณ ลดโอกาสของการเข้ามาโดยไม่ได้รับอนุญาตและการละเมิดข้อมูล ด้วยความชื่นชมแง่มุมสำคัญของความปลอดภัยทางไซเบอร์นี้ ทำให้เห็นได้ชัดว่าไม่เพียงแต่เกี่ยวกับการรับรู้เท่านั้น แต่ยังรวมถึงการดำเนินการด้วย นี่คือจุดที่โซลูชันอย่าง Entro เข้ามามีบทบาท ออกแบบมาโดยเฉพาะเพื่อรับมือกับความท้าทายที่เราได้สำรวจ Entro นำเสนอแนวทางที่ครอบคลุมในการจัดการความลับที่เหนือกว่าการสแกนขั้นพื้นฐาน โดยให้บริบทที่สำคัญที่จำเป็นสำหรับการแก้ไขและป้องกันที่มีประสิทธิผล โดยจะสร้างแผนผังโมเดลภัยคุกคามแบบไดนามิกโดยใช้บริบทนี้ จึงทำให้องค์กรของคุณก้าวนำหน้าในการเผชิญกับภัยคุกคามด้านความปลอดภัย การปกป้องข้อมูลที่ละเอียดอ่อนขององค์กรของคุณมีความสำคัญเกินกว่าจะปล่อยให้เป็นโอกาส ด้วยเหตุนี้ จึงถึงเวลาควบคุมพลังของการจัดการเชิงรุกและเชิงกลยุทธ์สำหรับความลับที่ถูกเปิดเผย ลองดูของเราเพื่อสำรวจว่า Entro สามารถเสริมความแข็งแกร่งให้กับสถานะการรักษาความปลอดภัยขององค์กรของคุณได้อย่างไร เพื่อเรียนรู้เพิ่มเติมเกี่ยวกับ Entro และประโยชน์ที่จะเป็นประโยชน์ต่อองค์กรของคุณ window.dataLayer = window.dataLayer || []; ฟังก์ชัน gtag(){dataLayer.push(อาร์กิวเมนต์);} gtag(&#39;js&#39;, วันที่ใหม่()); gtag(&#39;config&#39;, &#39;G-6BQMQDE452&#39;);"
  },
  {
    "id": "_3cxnn8gc4",
    "category": "Home",
    "title": "Orange Spain Faces BGP Traffic Hijack After RIPE Account Hacked by Malware",
    "date": "Jan 05, 2024",
    "author": "Newsroom",
    "pTags": "Network Security / Malware",
    "imgLinks": [
      "orange.jpg"
    ],
    "contentEn": "\nMobile network operator Orange Spain suffered an internet outage for several hours on January 3 after a threat actor used administrator credentials captured by means of stealer malware to hijack the border gateway protocol () traffic.\n\"The Orange account in the IP network coordination center (RIPE) has suffered improper access that has affected the browsing of some of our customers,\" the company  in a message posted on X (formerly Twitter).\nHowever, the company emphasized no personal data was compromised and that the incident only affected some browsing services.\n\nThe threat actor, who goes by the name Ms_Snow_OwO on X,  to have gained access to Orange Spain's RIPE account. RIPE is a regional Internet registry () that oversees the allocation and registration of IP addresses and autonomous system (AS) numbers in Europe, Central Asia, Russia, and West Asia.\n\"Using the stolen account, the threat actor modified the AS number belonging to Orange's IP address, resulting in major disruptions to Orange and a 50% loss in traffic,\" cybersecurity firm Hudson Rock .\n\nFurther analysis has revealed that the email address of the admin account is associated with the computer of an Orange Spain employee who was infiltrated by  on September 4, 2023.\nIt's currently not known how the stealer found its way to the employee's system, but such malware families are typically propagated via  or .\n\"Among the corporate credentials identified on the machine, the employee had specific credentials to 'https://access.ripe.net' using the email address which was revealed by the threat actor (adminripe-ipnt@orange.es),\" the company added.\nEven worse, the password used to secure Orange's RIPE administrator account was \"ripeadmin,\" which is both weak and easily predictable.\n\nSecurity researcher Kevin Beaumont further noted that RIPE neither mandates two-factor authentication (2FA) nor enforces a strong password policy for its accounts, making it ripe for abuse.\n\"Currently, infostealer marketplaces are selling thousands of credentials to access.ripe.net — effectively allowing you to repeat this at organizations and ISPs across Europe,\" Beaumont .\nRIPE, which is  to see if any other accounts have been affected in a similar manner, said it will directly reach out to affected account holders. It has also urged RIPE NCC Access account users to update their passwords and enable multi-factor authentication for their accounts.\n\"In the long term, we're expediting the 2FA implementation to make it mandatory for all RIPE NCC Access accounts as soon as possible and to introduce a variety of verification mechanisms,\" it .\nThe incident serves to highlight the consequences of infostealer infections, necessitating that organizations take steps to secure their networks from known initial attack vectors.\n\n\n\n",
    "ref": "https://thehackernews.com/2024/01/orange-spain-faces-bgp-traffic-hijack.html",
    "titleTh": "Orange Spain เผชิญกับการแย่งชิงข้อมูล BGP หลังจากบัญชี RIPE ถูกแฮ็กโดยมัลแวร์",
    "contentTh": "ผู้ให้บริการเครือข่ายมือถือ Orange Spain ประสบปัญหาอินเทอร์เน็ตขัดข้องเป็นเวลาหลายชั่วโมงในวันที่ 3 มกราคม หลังจากที่ผู้คุกคามใช้ข้อมูลประจำตัวของผู้ดูแลระบบที่ดักจับโดยมัลแวร์ขโมยมาเพื่อจี้การรับส่งข้อมูลโปรโตคอลเกตเวย์ชายแดน () “บัญชี Orange ในศูนย์ประสานงานเครือข่าย IP (RIPE) ได้รับความเดือดร้อนจากการเข้าถึงที่ไม่เหมาะสม ซึ่งส่งผลกระทบต่อการเรียกดูลูกค้าบางรายของเรา” บริษัทในข้อความที่โพสต์บน X (ชื่อเดิม Twitter) อย่างไรก็ตาม บริษัทเน้นย้ำว่าไม่มีข้อมูลส่วนบุคคลใดถูกบุกรุก และเหตุการณ์ดังกล่าวส่งผลกระทบต่อบริการเรียกดูบางบริการเท่านั้น ผู้คุกคามที่ใช้ชื่อ Ms_Snow_OwO ใน X ได้สิทธิ์เข้าถึงบัญชี RIPE ของ Orange Spain RIPE เป็นสำนักทะเบียนอินเทอร์เน็ตระดับภูมิภาค () ที่ดูแลการจัดสรรและการลงทะเบียนที่อยู่ IP และหมายเลขระบบอัตโนมัติ (AS) ในยุโรป เอเชียกลาง รัสเซีย และเอเชียตะวันตก “การใช้บัญชีที่ถูกขโมย ผู้คุกคามได้แก้ไขหมายเลข AS ที่เป็นของที่อยู่ IP ของ Orange ส่งผลให้เกิดการหยุดชะงักครั้งใหญ่ใน Orange และสูญเสียการรับส่งข้อมูล 50%” บริษัท รักษาความปลอดภัยทางไซเบอร์ Hudson Rock การวิเคราะห์เพิ่มเติมพบว่าที่อยู่อีเมลของบัญชีผู้ดูแลระบบเชื่อมโยงกับคอมพิวเตอร์ของพนักงาน Orange Spain ที่ถูกแทรกซึมภายในวันที่ 4 กันยายน 2023 ขณะนี้ยังไม่ทราบว่าผู้ขโมยค้นพบทางไปยังระบบของพนักงานได้อย่างไร แต่กลุ่มมัลแวร์ดังกล่าวมักแพร่กระจายผ่าน หรือ “ในบรรดาข้อมูลประจำตัวขององค์กรที่ระบุบนเครื่อง พนักงานมีข้อมูลประจำตัวเฉพาะสำหรับ &#39;https://access.ripe.net&#39; โดยใช้ที่อยู่อีเมลที่ถูกเปิดเผยโดยผู้คุกคาม (adminripe-ipnt@orange.es)&quot; เพิ่มบริษัท ที่แย่กว่านั้นคือรหัสผ่านที่ใช้เพื่อรักษาความปลอดภัยบัญชีผู้ดูแลระบบ RIPE ของ Orange คือ &quot;ripadmin&quot; ซึ่งทั้งไม่รัดกุมและคาดเดาได้ง่าย นักวิจัยด้านความปลอดภัย Kevin Beaumont กล่าวเพิ่มเติมว่า RIPE ไม่ได้บังคับการรับรองความถูกต้องด้วยสองปัจจัย (2FA) หรือบังคับใช้นโยบายรหัสผ่านที่รัดกุมสำหรับบัญชีของตน ทำให้สุกงอมสำหรับการละเมิด &quot;ปัจจุบัน ตลาดซื้อขายข้อมูลข่าวสารกำลังขายข้อมูลประจำตัวหลายพันรายการให้กับ access.ripe.net ซึ่งช่วยให้คุณสามารถทำซ้ำได้อย่างมีประสิทธิภาพที่องค์กรและ ISP ทั่วยุโรป&quot; Beaumont RIPE ซึ่งเพื่อดูว่าบัญชีอื่น ๆ ได้รับผลกระทบในลักษณะเดียวกันหรือไม่ กล่าวว่าจะติดต่อเจ้าของบัญชีที่ได้รับผลกระทบโดยตรง นอกจากนี้ ยังเรียกร้องให้ผู้ใช้บัญชี RIPE NCC Access อัปเดตรหัสผ่านและเปิดใช้งานการตรวจสอบสิทธิ์แบบหลายปัจจัยสำหรับบัญชีของตน &quot;ในระยะยาว เรากำลังเร่งดำเนินการตาม 2FA เพื่อบังคับใช้กับบัญชี RIPE NCC Access ทั้งหมดโดยเร็วที่สุด และเพื่อแนะนำกลไกการตรวจสอบที่หลากหลาย&quot; เหตุการณ์ดังกล่าวทำหน้าที่เน้นย้ำถึงผลที่ตามมาจากการติดเชื้อ infostealer ทำให้องค์กรจำเป็นต้องดำเนินการเพื่อรักษาความปลอดภัยเครือข่ายของตนจากการโจมตีครั้งแรกที่รู้จัก"
  },
  {
    "id": "_rk1744f1q",
    "category": "Home",
    "title": "Alert: Ivanti Releases Patch for Critical Vulnerability in Endpoint Manager Solution",
    "date": "Jan 05, 2024",
    "author": "Newsroom",
    "pTags": "Vulnerability / Network Security",
    "imgLinks": [
      "ivanti.jpg"
    ],
    "contentEn": "\nIvanti has released security updates to address a critical flaw impacting its Endpoint Manager (EPM) solution that, if successfully exploited, could result in remote code execution (RCE) on susceptible servers.\nTracked as CVE-2023-39336, the vulnerability has been rated 9.6 out of 10 on the CVSS scoring system. The shortcoming impacts EPM 2021 and EPM 2022 prior to SU5.\n\"If exploited, an attacker with access to the internal network can leverage an unspecified SQL injection to execute arbitrary SQL queries and retrieve output without the need for authentication,\" Ivanti  in an advisory.\n\n\"This can then allow the attacker control over machines running the EPM agent. When the core server is configured to use SQL express, this might lead to RCE on the core server.\"\nThe disclosure arrived weeks after the company  nearly two dozen security flaws in its Avalanche enterprise mobile device management (MDM) solution.\nOf the 21 issues, 13 are rated critical (CVSS scores: 9.8) and have been characterized as unauthenticated buffer overflows. They have been patched in Avalanche 6.4.2.\n\"An attacker sending specially crafted data packets to the Mobile Device Server can cause memory corruption which could result in a denial-of-service (DoS) or code execution,\" Ivanti .\n\nWhile there is no evidence that these aforementioned weaknesses have been exploited in the wild, state-backed actors have, in the past, exploited  (CVE-2023-35078 and CVE-2023-35081) in Ivanti Endpoint Manager Mobile (EPMM) to infiltrate the networks of multiple Norwegian government organizations.\nA month later,  in the Ivanti Sentry product (CVE-2023-38035, CVSS score: 9.8) came under active exploitation as a zero-day. \n\n\n\n",
    "ref": "https://thehackernews.com/2024/01/alert-ivanti-releases-patch-for.html",
    "titleTh": "การแจ้งเตือน: Ivanti เผยแพร่แพทช์สำหรับช่องโหว่ที่สำคัญในโซลูชัน Endpoint Manager",
    "contentTh": "Ivanti ได้เปิดตัวการอัปเดตความปลอดภัยเพื่อแก้ไขข้อบกพร่องร้ายแรงที่ส่งผลกระทบต่อโซลูชัน Endpoint Manager (EPM) ซึ่งหากช่องโหว่ประสบความสำเร็จ อาจส่งผลให้เกิดการเรียกใช้โค้ดจากระยะไกล (RCE) บนเซิร์ฟเวอร์ที่อ่อนแอ ช่องโหว่นี้ถูกติดตามในชื่อ CVE-2023-39336 โดยได้รับการจัดอันดับ 9.6 เต็ม 10 ในระบบการให้คะแนน CVSS ข้อบกพร่องดังกล่าวส่งผลกระทบต่อ EPM 2021 และ EPM 2022 ก่อน SU5 “หากถูกโจมตี ผู้โจมตีที่สามารถเข้าถึงเครือข่ายภายในสามารถใช้ประโยชน์จากการฉีด SQL ที่ไม่ระบุเพื่อดำเนินการสืบค้น SQL โดยพลการ และดึงข้อมูลเอาต์พุตโดยไม่จำเป็นต้องตรวจสอบสิทธิ์” Ivanti กล่าวในที่ปรึกษา “สิ่งนี้สามารถอนุญาตให้ผู้โจมตีควบคุมเครื่องที่ใช้เอเจนต์ EPM ได้ เมื่อเซิร์ฟเวอร์หลักได้รับการกำหนดค่าให้ใช้ SQL express สิ่งนี้อาจนำไปสู่ RCE บนเซิร์ฟเวอร์หลัก” การเปิดเผยดังกล่าวเกิดขึ้นหลายสัปดาห์หลังจากที่บริษัทพบข้อบกพร่องด้านความปลอดภัยเกือบสองโหลในโซลูชันการจัดการอุปกรณ์มือถือระดับองค์กร (MDM) ของ Avalanche จาก 21 ประเด็น มี 13 ประเด็นที่ได้รับการจัดอันดับวิกฤต (คะแนน CVSS: 9.8) และถูกกำหนดให้เป็นบัฟเฟอร์ล้นที่ไม่ได้รับการรับรองความถูกต้อง พวกเขาได้รับการแก้ไขใน Avalanche 6.4.2 แล้ว “ผู้โจมตีที่ส่งแพ็กเก็ตข้อมูลที่จัดทำขึ้นเป็นพิเศษไปยังเซิร์ฟเวอร์อุปกรณ์มือถืออาจทำให้เกิดความเสียหายของหน่วยความจำซึ่งอาจส่งผลให้เกิดการปฏิเสธการให้บริการ (DoS) หรือการเรียกใช้โค้ด” Ivanti แม้ว่าจะไม่มีหลักฐานว่าจุดอ่อนดังกล่าวถูกนำไปใช้ประโยชน์ในป่า แต่ในอดีตผู้แสดงที่ได้รับการสนับสนุนจากรัฐก็เคยถูกเอาเปรียบ (CVE-2023-35078 และ CVE-2023-35081) ใน Ivanti Endpoint Manager Mobile (EPMM) เพื่อแทรกซึม เครือข่ายขององค์กรรัฐบาลนอร์เวย์หลายแห่ง หนึ่งเดือนต่อมา ในผลิตภัณฑ์ Ivanti Sentry (CVE-2023-38035, คะแนน CVSS: 9.8) ตกอยู่ภายใต้การเอารัดเอาเปรียบอย่างแข็งขันเป็นศูนย์วัน"
  },
  {
    "id": "_26ju6wo4e",
    "category": "Home",
    "title": "Russian Hackers Had Covert Access to Ukraine's Telecom Giant for Months",
    "date": "Jan 05, 2024",
    "author": "Newsroom",
    "pTags": "Cyber Attack / Data Breach",
    "imgLinks": [
      "telecom.jpg"
    ],
    "contentEn": "\nUkrainian cybersecurity authorities have disclosed that the Russian state-sponsored threat actor known as  was inside telecom operator Kyivstar's systems at least since May 2023.\nThe development was  by Reuters.\nThe , described as a \"powerful hacker attack,\" first came to light last month, knocking out access to mobile and internet services for millions of customers. Soon after the incident, a Russia-linked hacking group called Solntsepyok took responsibility for the breach.\nSolntsepyok has been assessed to be a Russian threat group with affiliations to the Main Directorate of the General Staff of the Armed Forces of the Russian Federation (GRU), which also operates Sandworm.\n\nThe advanced persistent threat (APT) actor has a track record of orchestrating , with Denmark  the hacking outfit of targeting 22 energy sector companies last year.\nIllia Vitiuk, head of the Security Service of Ukraine's (SBU) cybersecurity department, said the attack against Kyivstar wiped out nearly everything from thousands of virtual servers and computers.\nThe incident, he said, \"completely destroyed the core of a telecoms operator,\" noting the attackers had full access likely at least since November, months after obtaining an initial foothold into the company's infrastructure.\n\"The attack had been carefully prepared during many months,\" Vitiuk  in a statement shared on the SBU's website.\nKyivstar, which has since , said there is no evidence that the personal data of subscribers has been compromised. It's currently not known how the threat actor penetrated its network.\n\nIt's worth noting that the company had  speculations about the attackers destroying its computers and servers as \"fake.\"\nThe disclosure comes as the SBU  earlier this week that it took down two online surveillance cameras that were allegedly hacked by Russian intelligence agencies to spy on the defense forces and critical infrastructure in the capital city of Kyiv.\nThe agency said the compromise allowed the adversary to gain remote control of the cameras, adjust their viewing angles, and connect them to YouTube to capture \"all visual information in the range of the camera.\"\n\n\n\n",
    "ref": "https://thehackernews.com/2024/01/russian-hackers-had-covert-access-to.html",
    "titleTh": "แฮกเกอร์ชาวรัสเซียแอบเข้าถึงยักษ์ใหญ่โทรคมนาคมของยูเครนเป็นเวลาหลายเดือน",
    "contentTh": "เจ้าหน้าที่รักษาความปลอดภัยทางไซเบอร์ของยูเครนเปิดเผยว่าผู้คุกคามที่ได้รับการสนับสนุนจากรัฐรัสเซียซึ่งเป็นที่รู้จักในชื่อนั้นอยู่ในระบบของผู้ให้บริการโทรคมนาคม Kyivstar อย่างน้อยตั้งแต่เดือนพฤษภาคม 2023 การพัฒนาดำเนินการโดยสำนักข่าวรอยเตอร์ การโจมตีของแฮ็กเกอร์ซึ่งอธิบายว่าเป็น &quot;การโจมตีของแฮ็กเกอร์ที่ทรงพลัง&quot; เกิดขึ้นครั้งแรกเมื่อเดือนที่แล้ว ทำให้ลูกค้าหลายล้านคนไม่สามารถเข้าถึงบริการมือถือและอินเทอร์เน็ตได้ ไม่นานหลังจากเหตุการณ์ดังกล่าว กลุ่มแฮ็กเกอร์ที่เชื่อมโยงกับรัสเซียชื่อ Solntsepyok ก็รับผิดชอบต่อการละเมิดดังกล่าว Solntsepyok ได้รับการประเมินว่าเป็นกลุ่มภัยคุกคามของรัสเซียที่มีความเกี่ยวข้องกับ Main Directorate of the General Staff of the Armed Forces of the Armed Forces of the Russian Federation (GRU) ซึ่งปฏิบัติการ Sandworm ด้วย ผู้แสดงภัยคุกคามขั้นสูงแบบถาวร (APT) มีประวัติในการจัดการ โดยเดนมาร์กเป็นกลุ่มแฮ็กที่กำหนดเป้าหมายบริษัทในภาคพลังงาน 22 แห่งเมื่อปีที่แล้ว Illia Vitiuk หัวหน้าฝ่ายบริการรักษาความปลอดภัยของแผนกความปลอดภัยทางไซเบอร์ของยูเครน (SBU) กล่าวว่าการโจมตี Kyivstar ได้กวาดล้างเกือบทุกอย่างจากเซิร์ฟเวอร์เสมือนและคอมพิวเตอร์หลายพันเครื่อง เขากล่าวว่าเหตุการณ์ดังกล่าว “ทำลายแกนหลักของผู้ให้บริการโทรคมนาคมโดยสิ้นเชิง” โดยสังเกตว่าผู้โจมตีสามารถเข้าถึงได้อย่างเต็มที่อย่างน้อยตั้งแต่เดือนพฤศจิกายน ไม่กี่เดือนหลังจากได้รับการตั้งหลักเบื้องต้นในโครงสร้างพื้นฐานของบริษัท “การโจมตีได้รับการเตรียมการอย่างระมัดระวังในช่วงหลายเดือนมานี้” วิทิอุก ระบุในถ้อยแถลงที่แชร์บนเว็บไซต์ของ SBU Kyivstar ซึ่งนับตั้งแต่นั้นเป็นต้นมา กล่าวว่าไม่มีหลักฐานว่าข้อมูลส่วนบุคคลของสมาชิกถูกบุกรุก ขณะนี้ยังไม่ทราบว่าผู้คุกคามเจาะเครือข่ายของตนได้อย่างไร เป็นที่น่าสังเกตว่าบริษัทมีการคาดเดาเกี่ยวกับผู้โจมตีที่ทำลายคอมพิวเตอร์และเซิร์ฟเวอร์ของตนว่าเป็น &quot;ของปลอม&quot; การเปิดเผยดังกล่าวเกิดขึ้นในขณะที่ SBU เมื่อต้นสัปดาห์นี้ว่าได้รื้อกล้องวงจรปิดออนไลน์ 2 ตัวที่ถูกกล่าวหาว่าถูกหน่วยข่าวกรองรัสเซียแฮ็กเพื่อสอดแนมกองกำลังป้องกันและโครงสร้างพื้นฐานที่สำคัญในเมืองหลวงของเคียฟ หน่วยงานดังกล่าวกล่าวว่าการประนีประนอมทำให้ฝ่ายตรงข้ามสามารถควบคุมกล้องจากระยะไกล ปรับมุมมอง และเชื่อมต่อกับ YouTube เพื่อบันทึก &quot;ข้อมูลภาพทั้งหมดที่อยู่ในระยะของกล้อง&quot;"
  },
  {
    "id": "_gannolaru",
    "category": "Home",
    "title": "New Bandook RAT Variant Resurfaces, Targeting Windows Machines",
    "date": "Jan 05, 2024",
    "author": "Newsroom",
    "pTags": "Malware / Cyber Espionage",
    "imgLinks": [
      "windows.jpg"
    ],
    "contentEn": "\nA new variant of remote access trojan called Bandook has been observed being propagated via phishing attacks with an aim to infiltrate Windows machines, underscoring the continuous evolution of the malware.\nFortinet FortiGuard Labs, which identified the activity in October 2023, said the malware is distributed via a PDF file that embeds a link to a password-protected .7z archive.\n\"After the victim extracts the malware with the password in the PDF file, the malware injects its payload into msinfo32.exe,\" security researcher Pei Han Liao .\nBandook, first detected in 2007, is an  that comes with a wide range of features to remotely gain control of the infected systems.\n\nIn July 2021, Slovak cybersecurity firm ESET  a cyber espionage campaign that leveraged an upgraded variant of Bandook to breach corporate networks in Spanish-speaking countries such as Venezuela.\n\nThe starting point of the latest attack sequence is an injector component that's designed to decrypt and load the payload into , a legitimate Windows binary that gathers system information to diagnose computer issues.\nThe malware, besides making Windows Registry changes to establish persistence on the compromised host, establishes contact with a command-and-control (C2) server to retrieve additional payloads and instructions.\n\"These actions can be roughly categorized as file manipulation, registry manipulation, download, information stealing, file execution, invocation of functions in DLLs from the C2, controlling the victim's computer, process killing, and uninstalling the malware,\" Han Liao said. \n\n\n\n",
    "ref": "https://thehackernews.com/2024/01/new-bandook-rat-variant-resurfaces.html",
    "titleTh": "Bandook RAT Variant ใหม่กลับมาอีกครั้ง โดยมุ่งเป้าไปที่เครื่อง Windows",
    "contentTh": "โทรจันการเข้าถึงระยะไกลรูปแบบใหม่ที่เรียกว่า Bandook ถูกพบว่าแพร่กระจายผ่านการโจมตีแบบฟิชชิ่งโดยมีจุดประสงค์เพื่อแทรกซึมเข้าไปในเครื่อง Windows ซึ่งเน้นย้ำถึงการพัฒนาอย่างต่อเนื่องของมัลแวร์ Fortinet FortiGuard Labs ซึ่งระบุกิจกรรมในเดือนตุลาคม 2566 กล่าวว่ามัลแวร์ถูกเผยแพร่ผ่านไฟล์ PDF ที่ฝังลิงก์ไปยังไฟล์เก็บถาวร .7z ที่ป้องกันด้วยรหัสผ่าน “หลังจากที่เหยื่อแยกมัลแวร์ด้วยรหัสผ่านในไฟล์ PDF มัลแวร์จะแทรกเพย์โหลดของมันลงใน msinfo32.exe” นักวิจัยด้านความปลอดภัย Pei Han Liao Bandook ซึ่งตรวจพบครั้งแรกในปี 2550 เป็นซอฟต์แวร์ที่มาพร้อมกับคุณสมบัติที่หลากหลายในการควบคุมระบบที่ติดไวรัสจากระยะไกล ในเดือนกรกฎาคม 2021 บริษัทรักษาความปลอดภัยทางไซเบอร์ของสโลวาเกีย ESET แคมเปญจารกรรมทางไซเบอร์ที่ใช้ประโยชน์จาก Bandook รุ่นอัพเกรดเพื่อเจาะเครือข่ายองค์กรในประเทศที่พูดภาษาสเปน เช่น เวเนซุเอลา จุดเริ่มต้นของลำดับการโจมตีล่าสุดคือส่วนประกอบหัวฉีดที่ออกแบบมาเพื่อถอดรหัสและโหลดเพย์โหลดลงใน ซึ่งเป็นไบนารี Windows ที่ถูกต้องตามกฎหมายที่รวบรวมข้อมูลระบบเพื่อวินิจฉัยปัญหาคอมพิวเตอร์ มัลแวร์นอกเหนือจากการเปลี่ยนแปลงรีจิสทรีของ Windows เพื่อสร้างการคงอยู่บนโฮสต์ที่ถูกบุกรุกแล้ว ยังสร้างการติดต่อกับเซิร์ฟเวอร์คำสั่งและการควบคุม (C2) เพื่อดึงข้อมูลเพย์โหลดและคำแนะนำเพิ่มเติม “การกระทำเหล่านี้สามารถแบ่งคร่าวๆ ได้เป็นการจัดการไฟล์ การจัดการรีจิสทรี การดาวน์โหลด การขโมยข้อมูล การเรียกใช้ไฟล์ การเรียกใช้ฟังก์ชันใน DLL จาก C2 การควบคุมคอมพิวเตอร์ของเหยื่อ การฆ่ากระบวนการ และการถอนการติดตั้งมัลแวร์” Han Liao กล่าว"
  },
  {
    "id": "_hvlb8sb1p",
    "category": "Home",
    "title": "Sea Turtle Cyber Espionage Campaign Targets Dutch IT and Telecom Companies",
    "date": "Jan 06, 2024",
    "author": "Newsroom",
    "pTags": "Cyber Espionage / Supply Chain Attack",
    "imgLinks": [
      "hacker.jpg"
    ],
    "contentEn": "\nTelecommunication, media, internet service providers (ISPs), information technology (IT)-service providers, and Kurdish websites in the Netherlands have been targeted as part of a new cyber espionage campaign undertaken by a Türkiye-nexus threat actor known as Sea Turtle.\n\"The infrastructure of the targets was susceptible to supply chain and island-hopping attacks, which the attack group used to collect politically motivated information such as personal information on minority groups and potential political dissents,\" Dutch security firm Hunt & Hackett  in a Friday analysis.\n\"The stolen information is likely to be exploited for surveillance or intelligence gathering on specific groups and or individuals.\"\nSea Turtle, also known by the names Cosmic Wolf, Marbled Dust (formerly Silicon), Teal Kurma, and UNC1326, was  by Cisco Talos in April 2019, detailing  targeting public and private entities in the Middle East and North Africa.\n\nActivities associated with the group are believed to have been ongoing since January 2017, primarily leveraging  to redirect prospective targets attempting to query a specific domain to an actor-controlled server capable of harvesting their credentials.\n\"The Sea Turtle campaign almost certainly poses a more severe threat than  given the actor's methodology in targeting various DNS registrars and registries,\" Talos said at the time.\nIn late 2021, Microsoft  that the adversary carries out intelligence collection to meet strategic Turkish interests from countries like Armenia, Cyprus, Greece, Iraq, and Syria, striking telecom and IT companies with an aim to \"establish a foothold upstream of their desired target\" via exploitation of known vulnerabilities.\nThen last month, the adversary was revealed to be using a simple reverse TCP shell for Linux (and Unix) systems called SnappyTCP in attacks carried out between 2021 and 2023, according to the PricewaterhouseCoopers (PwC) Threat Intelligence team.\n\"The web shell is a simple reverse TCP shell for Linux/Unix that has basic [command-and-control] capabilities, and is also likely used for establishing persistence,\" the company . \"There are at least two main variants; one which uses OpenSSL to create a secure connection over TLS, while the other omits this capability and sends requests in cleartext.\"\nThe latest findings from Hunt & Hackett show that Sea Turtle continues to be a stealthy espionage-focused group, performing defense evasion techniques to fly under the radar and harvest email archives.\n\nIn one of the attacks observed in 2023, a compromised-but-legitimate cPanel account was used as an initial access vector to deploy SnappyTCP on the system. It's currently not known how the attackers obtained the credentials.\n\"Using SnappyTCP, the threat actor sent commands to the system to create a copy of an email archive created with the tool tar, in the public web directory of the website that was accessible from the internet,\" the firm noted.\n\"It is highly likely that the threat actor exfiltrated the email archive by downloading the file directly from the web directory.\"\nTo mitigate the risks posed by such attacks, it's advised that organizations enforce strong password policies, implement two-factor authentication (2FA),  to reduce the chances of brute-force attempts, monitor SSH traffic, and keep all systems and software up-to-date.\n\n\n\n\n",
    "ref": "https://thehackernews.com/2024/01/sea-turtle-cyber-espionage-campaign.html",
    "titleTh": "แคมเปญจารกรรมทางไซเบอร์ของเต่าทะเลมุ่งเป้าไปที่บริษัทไอทีและโทรคมนาคมของเนเธอร์แลนด์",
    "contentTh": "โทรคมนาคม สื่อ ผู้ให้บริการอินเทอร์เน็ต (ISP) ผู้ให้บริการเทคโนโลยีสารสนเทศ (IT) และเว็บไซต์ชาวเคิร์ดในเนเธอร์แลนด์ ได้รับการกำหนดเป้าหมายว่าเป็นส่วนหนึ่งของแคมเปญจารกรรมทางไซเบอร์ชุดใหม่ที่ดำเนินการโดยผู้คุกคามในตุรกี-เน็กซัสที่รู้จักกันในชื่อ Sea Turtle “โครงสร้างพื้นฐานของเป้าหมายอ่อนไหวต่อห่วงโซ่อุปทานและการโจมตีแบบข้ามเกาะ ซึ่งกลุ่มโจมตีใช้ในการรวบรวมข้อมูลที่มีแรงจูงใจทางการเมือง เช่น ข้อมูลส่วนบุคคลของกลุ่มชนกลุ่มน้อยและผู้ที่ไม่เห็นด้วยกับทางการเมือง” บริษัทรักษาความปลอดภัยของเนเธอร์แลนด์ ฮันท์ แอนด์ แฮคเก็ตต์ ในการวิเคราะห์เมื่อวันศุกร์ . “ข้อมูลที่ขโมยไปมีแนวโน้มที่จะถูกนำไปใช้เพื่อการสอดแนมหรือการรวบรวมข่าวกรองกับกลุ่มและหรือบุคคลเฉพาะ” Sea Turtle หรือที่รู้จักกันในชื่อ Cosmic Wolf, Marbled Dust (เดิมชื่อ Silicon), Teal Kurma และ UNC1326 จัดทำโดย Cisco Talos ในเดือนเมษายน 2019 โดยมีรายละเอียดที่กำหนดเป้าหมายหน่วยงานภาครัฐและเอกชนในตะวันออกกลางและแอฟริกาเหนือ เชื่อกันว่ากิจกรรมที่เกี่ยวข้องกับกลุ่มดำเนินไปอย่างต่อเนื่องตั้งแต่เดือนมกราคม 2560 โดยส่วนใหญ่ใช้ประโยชน์จากการเปลี่ยนเส้นทางเป้าหมายที่คาดหวังที่พยายามสืบค้นโดเมนเฉพาะไปยังเซิร์ฟเวอร์ที่ควบคุมโดยนักแสดงซึ่งสามารถเก็บเกี่ยวข้อมูลรับรองได้ “แคมเปญ Sea Turtle เกือบจะก่อให้เกิดภัยคุกคามที่รุนแรงกว่าวิธีการของนักแสดงในการกำหนดเป้าหมายผู้รับจดทะเบียน DNS และผู้รับจดทะเบียนต่างๆ” Talos กล่าวในขณะนั้น ในช่วงปลายปี 2021 ไมโครซอฟต์ที่ฝ่ายตรงข้ามดำเนินการรวบรวมข่าวกรองเพื่อตอบสนองผลประโยชน์เชิงกลยุทธ์ของตุรกีจากประเทศต่างๆ เช่น อาร์เมเนีย ไซปรัส กรีซ อิรัก และซีเรีย โจมตีบริษัทโทรคมนาคมและไอทีโดยมีเป้าหมายเพื่อ &quot;สร้างฐานที่ต้นน้ำของเป้าหมายที่ต้องการ&quot; ผ่านการใช้ประโยชน์จากช่องโหว่ที่ทราบ เมื่อเดือนที่แล้ว ฝ่ายตรงข้ามถูกเปิดเผยว่าใช้เชลล์ TCP แบบย้อนกลับแบบธรรมดาสำหรับระบบ Linux (และ Unix) ที่เรียกว่า SnappyTCP ในการโจมตีที่ดำเนินการระหว่างปี 2564 ถึง 2566 ตามรายงานของทีมข่าวกรองภัยคุกคาม PricewaterhouseCoopers (PwC) “เว็บเชลล์เป็นเชลล์ TCP แบบย้อนกลับอย่างง่ายสำหรับ Linux/Unix ที่มีความสามารถพื้นฐาน [คำสั่งและการควบคุม] และยังมีแนวโน้มที่จะใช้เพื่อสร้างความคงอยู่” บริษัท “มีอย่างน้อยสองรูปแบบหลัก รูปแบบหนึ่งใช้ OpenSSL เพื่อสร้างการเชื่อมต่อที่ปลอดภัยผ่าน TLS ในขณะที่อีกรูปแบบหนึ่งละเว้นความสามารถนี้และส่งคำขอในรูปแบบเคลียร์เท็กซ์” การค้นพบล่าสุดจาก Hunt &amp; Hackett แสดงให้เห็นว่า Sea Turtle ยังคงเป็นกลุ่มที่เน้นการจารกรรมอย่างลับๆ ล่อๆ โดยใช้เทคนิคการหลบเลี่ยงการป้องกันเพื่อแอบดูเรดาร์และเก็บอีเมลที่เก็บถาวร หนึ่งในการโจมตีที่สังเกตได้ในปี 2023 บัญชี cPanel ที่ถูกบุกรุกแต่ถูกกฎหมายถูกใช้เป็นเวกเตอร์การเข้าถึงเบื้องต้นเพื่อปรับใช้ SnappyTCP บนระบบ ขณะนี้ยังไม่ทราบว่าผู้โจมตีได้รับข้อมูลรับรองมาอย่างไร “การใช้ SnappyTCP ผู้คุกคามส่งคำสั่งไปยังระบบเพื่อสร้างสำเนาของไฟล์เก็บถาวรอีเมลที่สร้างด้วย tool tar ในไดเร็กทอรีเว็บสาธารณะของเว็บไซต์ที่สามารถเข้าถึงได้จากอินเทอร์เน็ต” บริษัทกล่าว &quot;มีความเป็นไปได้สูงที่ผู้คุกคามจะเจาะระบบอีเมลโดยการดาวน์โหลดไฟล์โดยตรงจากสารบบเว็บ&quot; เพื่อลดความเสี่ยงที่เกิดจากการโจมตีดังกล่าว ขอแนะนำว่าองค์กรต่างๆ บังคับใช้นโยบายรหัสผ่านที่รัดกุม ใช้การตรวจสอบสิทธิ์แบบสองปัจจัย (2FA) เพื่อลดโอกาสของความพยายามแบบเดรัจฉาน ตรวจสอบการรับส่งข้อมูล SSH และรักษาระบบและซอฟต์แวร์ทั้งหมดให้ทันสมัย -วันที่."
  },
  {
    "id": "_s23lw7qsa",
    "category": "Home",
    "title": "Pro-Iranian Hacker Group Targeting Albania with No-Justice Wiper Malware",
    "date": "Jan 06, 2024",
    "author": "Newsroom",
    "pTags": "Malware / Cyber Attack",
    "imgLinks": [
      "apple.jpg"
    ],
    "contentEn": "\nThe  targeting Albanian organizations involved the use of a wiper called No-Justice.\nThe  come from cybersecurity company ClearSky, which said the Windows-based malware \"crashes the operating system in a way that it cannot be rebooted.\"\nThe intrusions have been attributed to an Iranian \"psychological operation group\" known as Homeland Justice, which has been active since July 2022, specifically orchestrating destructive attacks against Albania.\nOn December 24, 2023, the adversary resurfaced after a hiatus, stating it's \"back to destroy supporters of terrorists,\" describing its latest campaign as #DestroyDurresMilitaryCamp. The Albanian city of Durrës  the dissident group People's Mojahedin Organization of Iran (MEK).\nTargets of the attack included ONE Albania, Eagle Mobile Albania, Air Albania, and the Albanian parliament.\nTwo of the primary tools deployed during the campaign include an executable wiper and a PowerShell script that's designed to propagate the former to other machines in the target network after enabling Windows Remote Management ().\n\nThe  (NACL.exe) is a 220.34 KB binary that requires administrator privileges to erase the data on the computer.\nThis is accomplished by removing the boot signature from the Master Boot Record (), which refers to the first sector of any hard disk that identifies where the operating system is located in the disk so that it can be loaded into a computer's RAM.\nAlso delivered over the course of the attack are legitimate tools like Plink (aka PuTTY Link), RevSocks, and the Windows 2000 resource kit to facilitate reconnaissance, lateral movement, and persistent remote access.\n\nThe development comes as  such as , , , and YareGomnam Team have increasingly set their sights on Israel and the U.S. amid continuing geopolitical tensions in the Middle East.\n\"Groups such as Cyber Av3ngers and Cyber Toufan appear to be adopting a narrative of retaliation in their cyber attacks,\" Check Point  last month.\n\"By opportunistically targeting U.S. entities using Israeli technology, these hacktivist proxies try to achieve a dual retaliation strategy – claiming to target both Israel and the U.S. in a single, orchestrated cyber assault.\"\n\nCyber Toufan, in particular, has been  to a deluge of hack-and-leak operations targeting over 100 organizations, wiping infected hosts and releasing stolen data on their .\n\"They've caused so much damage that many of the orgs – almost a third, in fact, haven't been able to recover,\" security researcher Kevin Beaumont . \"Some of these are still fully offline over a month later, and the wiped victims are a mix of private companies and Israeli state government entities.\"\nLast month, the Israel National Cyber Directorate (INCD)  it's currently tracking roughly 15 hacker groups associated with Iran, Hamas, and Hezbollah that are maliciously operating in Israeli cyberspace since the onset of the Israel-Hamas war in October 2023.\nThe agency further noted that the techniques and tactics employed share similarities with those used in the Ukraine-Russia war, leveraging psychological warfare and wiper malware to destroy sensitive information.\n\n\n\n",
    "ref": "https://thehackernews.com/2024/01/pro-iranian-hacker-group-targeting.html",
    "titleTh": "กลุ่มแฮ็กเกอร์ Pro-Iranian กำหนดเป้าหมายไปที่แอลเบเนียด้วยมัลแวร์ Wiper No-Justice",
    "contentTh": "องค์กรแอลเบเนียที่กำหนดเป้าหมายเกี่ยวข้องกับการใช้ที่ปัดน้ำฝนที่เรียกว่า No-Justice ข้อมูลดังกล่าวมาจากบริษัทด้านความปลอดภัยทางไซเบอร์ ClearSky ซึ่งกล่าวว่ามัลแวร์ที่ใช้ Windows &quot;ทำให้ระบบปฏิบัติการขัดข้องในลักษณะที่ไม่สามารถรีบูตได้&quot; การบุกรุกดังกล่าวมีสาเหตุมาจาก &quot;กลุ่มปฏิบัติการทางจิตวิทยา&quot; ของอิหร่านที่รู้จักกันในชื่อ Homeland Justice ซึ่งเริ่มดำเนินการมาตั้งแต่เดือนกรกฎาคม พ.ศ. 2565 โดยเฉพาะอย่างยิ่งการจัดเตรียมการโจมตีแบบทำลายล้างต่อแอลเบเนีย เมื่อวันที่ 24 ธันวาคม พ.ศ. 2566 ศัตรูปรากฏตัวขึ้นอีกครั้งหลังจากหายไปโดยระบุว่า &quot;กลับมาเพื่อทำลายผู้สนับสนุนผู้ก่อการร้าย&quot; โดยบรรยายแคมเปญล่าสุดในชื่อ #DestroyDurresMilitaryCamp เมืองดูร์เรสแห่งแอลเบเนีย ซึ่งเป็นกลุ่มต่อต้านกลุ่มประชาชนโมจาเฮดินแห่งอิหร่าน (MEK) เป้าหมายของการโจมตี ได้แก่ ONE Albania, Eagle Mobile Albania, Air Albania และรัฐสภาแอลเบเนีย เครื่องมือหลักสองอย่างที่ใช้งานระหว่างแคมเปญ ได้แก่ ที่ปัดน้ำฝนที่ปฏิบัติการได้และสคริปต์ PowerShell ที่ออกแบบมาเพื่อเผยแพร่สคริปต์แรกไปยังเครื่องอื่นในเครือข่ายเป้าหมายหลังจากเปิดใช้งาน Windows Remote Management () (NACL.exe) เป็นไบนารีขนาด 220.34 KB ที่ต้องมีสิทธิ์ของผู้ดูแลระบบจึงจะลบข้อมูลในคอมพิวเตอร์ได้ ซึ่งทำได้โดยการลบลายเซ็นการบูตออกจาก Master Boot Record () ซึ่งหมายถึงเซกเตอร์แรกของฮาร์ดดิสก์ใดๆ ที่ระบุตำแหน่งของระบบปฏิบัติการในดิสก์ เพื่อให้สามารถโหลดลงใน RAM ของคอมพิวเตอร์ได้ นอกจากนี้ ในระหว่างการโจมตียังมีเครื่องมือที่ถูกต้องตามกฎหมายเช่น Plink (หรือที่เรียกว่า PuTTY Link), RevSocks และชุดทรัพยากร Windows 2000 เพื่ออำนวยความสะดวกในการลาดตระเวน การเคลื่อนไหวด้านข้าง และการเข้าถึงระยะไกลอย่างต่อเนื่อง การพัฒนาเกิดขึ้นเช่น , , , และทีมงาน YareGomnam ได้ตั้งเป้าหมายที่อิสราเอลและสหรัฐอเมริกามากขึ้น ท่ามกลางความตึงเครียดทางภูมิรัฐศาสตร์ที่ยังคงดำเนินต่อไปในตะวันออกกลาง “กลุ่มต่างๆ เช่น Cyber Av3ngers และ Cyber Toufan ดูเหมือนจะนำเรื่องเล่าของการตอบโต้ในการโจมตีทางไซเบอร์ของพวกเขามาใช้” Check Point เมื่อเดือนที่แล้ว &quot;ด้วยการฉวยโอกาสกำหนดเป้าหมายหน่วยงานของสหรัฐฯ โดยใช้เทคโนโลยีของอิสราเอล ผู้รับมอบฉันทะจากกลุ่มแฮ็กทีวิสต์เหล่านี้พยายามที่จะบรรลุกลยุทธ์การตอบโต้แบบคู่ขนาน โดยอ้างว่ากำหนดเป้าหมายทั้งอิสราเอลและสหรัฐฯ ในการโจมตีทางไซเบอร์ที่เตรียมการเพียงครั้งเดียว&quot; โดยเฉพาะอย่างยิ่ง Cyber Toufan ต้องเผชิญกับปฏิบัติการแฮ็กและรั่วไหลจำนวนมากโดยมีเป้าหมายมากกว่า 100 องค์กร ลบล้างโฮสต์ที่ติดไวรัสและปล่อยข้อมูลที่ถูกขโมยใน . “พวกมันสร้างความเสียหายมากจนองค์กรหลายแห่ง – เกือบหนึ่งในสามในความเป็นจริง ไม่สามารถกู้คืนได้” นักวิจัยด้านความปลอดภัย Kevin Beaumont “บางส่วนยังคงออฟไลน์โดยสมบูรณ์ในอีกหนึ่งเดือนต่อมา และเหยื่อที่ถูกลบล้างนั้นเป็นกลุ่มบริษัทเอกชนและหน่วยงานรัฐบาลของรัฐอิสราเอล” เมื่อเดือนที่แล้ว Israel National Cyber Directorate (INCD) กำลังติดตามกลุ่มแฮ็กเกอร์ประมาณ 15 กลุ่มที่เกี่ยวข้องกับอิหร่าน ฮามาส และฮิซบอลเลาะห์ ซึ่งปฏิบัติการอย่างมุ่งร้ายในโลกไซเบอร์ของอิสราเอล นับตั้งแต่เริ่มสงครามอิสราเอล-ฮามาสในเดือนตุลาคม 2023 หน่วยงานยังตั้งข้อสังเกตอีกว่าเทคนิคและยุทธวิธีที่ใช้มีความคล้ายคลึงกับที่ใช้ในสงครามยูเครน-รัสเซีย โดยใช้ประโยชน์จากสงครามจิตวิทยาและมัลแวร์เพื่อทำลายข้อมูลที่ละเอียดอ่อน"
  }
]